{
  "Python": {
    "courseImage": "/CourseDetails/Python.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design Python course content at ICLP. Our Python Syllabus is developed by expert-level programming professionals to make sure of providing the best anytime-anywhere training environment for the aspirants. Python course details provide you with valuable and super clear information about all the Python programming concepts and also help you become a notable Python developer in the future. Below you will find the complete Python course details.",
    "section1": {
      "title": "Python Course Content",
      "description": "In-depth exploratory research is carried out by experts to design Python course content at MindMajix. Our Python Syllabus is developed by expert-level programming professionals to make sure of providing the best anytime-anywhere training environment for the aspirants. Python course details provide you with valuable and super clear information about all the Python programming concepts and also help you become a notable Python developer in the future. Below you will find the complete Python course details."
    },
    "section2": {
      "title": "Build Your Future with Python",
      "description": "Learn the Most In-Demand Programming Language & Launch a High-Paying Tech Career. Python is more than just a programming language—it's the gateway to a world of career opportunities in today's fast-evolving tech industry. Whether you're a student, job seeker, or working professional looking to upskill, mastering Python can be your first step toward a future-proof, high-paying career.",
      "bulletPoints": [
        "Beginner-Friendly: Easy to learn with simple syntax, perfect for freshers and non-programmers",
        "Versatile Language: Used in web development, data science, machine learning, automation, and more",
        "High Demand Across Industries: From startups to tech giants, everyone needs Python developers",
        "Strong Community Support: Tons of resources, tutorials, and open-source tools",
        "Future-Oriented: Powers innovations in AI, ML, robotics, data analytics, and cloud computing"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning Python",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "Python Developer",
        "Data Analyst",
        "Machine Learning Engineer",
        "AI Engineer",
        "Web Developer (Backend)",
        "Automation Tester",
        "Software Engineer",
        "DevOps Engineer",
        "Business Intelligence Analyst"
      ]
    }
  },
  "Java": {
    "courseImage": "/CourseDetails/Java.jpg",
    "courseDescription": "Our comprehensive Java course is designed by industry experts to provide you with in-depth knowledge of Java programming concepts. This course covers everything from basic syntax to advanced features, preparing you for a successful career as a Java developer. The syllabus is carefully crafted to ensure hands-on learning with real-world projects.",
    "section1": {
      "title": "Java Course Content",
      "description": "The Java course curriculum is structured to take you from fundamental concepts to advanced programming techniques. You'll learn object-oriented programming principles, Java collections framework, exception handling, multithreading, and modern Java features. Our practical approach ensures you gain the skills needed to build robust applications."
    },
    "section2": {
      "title": "Why Learn Java?",
      "description": "Java remains one of the most popular and versatile programming languages in the world, powering millions of applications across various domains. Mastering Java opens doors to numerous career opportunities in the ever-growing tech industry.",
      "bulletPoints": [
        "Platform Independence: Write once, run anywhere with Java's JVM",
        "High Demand: Consistently ranked among top programming languages",
        "Enterprise Standard: Preferred for large-scale business applications",
        "Strong Ecosystem: Vast collection of libraries and frameworks",
        "Android Development: Primary language for native Android apps"
      ]
    },
    "section3": {
      "title": "Career Paths with Java",
      "description": "Java skills can lead to various rewarding career opportunities including:",
      "bulletPoints": [
        "Java Developer",
        "Android Developer",
        "Backend Developer",
        "Software Engineer",
        "Full Stack Developer",
        "Enterprise Architect",
        "DevOps Engineer",
        "Big Data Engineer",
        "Cloud Solutions Developer"
      ]
    }
  },
  "R Programming": {
    "courseImage": "/CourseDetails/R.jpg",
    "courseDescription": "Our R Programming course provides comprehensive training in statistical computing and graphics. Designed by data science experts, this course equips you with the skills needed to perform complex data analysis, visualization, and statistical modeling using R. The curriculum combines theoretical knowledge with practical applications.",
    "section1": {
      "title": "R Programming Course Content",
      "description": "The R course covers data structures, data manipulation, statistical analysis, and visualization techniques. You'll learn to use RStudio, create reproducible research, and apply statistical methods to real-world datasets. The syllabus includes both base R and popular packages like ggplot2, dplyr, and shiny."
    },
    "section2": {
      "title": "The Power of R Programming",
      "description": "R is the language of choice for statisticians and data scientists worldwide. Its powerful capabilities make it indispensable for data analysis and research across industries.",
      "bulletPoints": [
        "Statistical Powerhouse: Designed specifically for statistical computing",
        "Data Visualization: Create publication-quality graphs and charts",
        "Open-Source Ecosystem: Thousands of specialized packages",
        "Academic Preference: Widely used in research and academia",
        "Interdisciplinary Applications: Used in finance, healthcare, marketing, and more"
      ]
    },
    "section3": {
      "title": "Career Opportunities with R",
      "description": "R programming skills can lead to exciting careers in data-driven fields:",
      "bulletPoints": [
        "Data Scientist",
        "Statistician",
        "Data Analyst",
        "Business Intelligence Analyst",
        "Quantitative Analyst",
        "Research Scientist",
        "Bioinformatician",
        "Machine Learning Engineer",
        "Data Visualization Specialist"
      ]
    }
  },
  "JavaScript": {
    "courseImage": "/CourseDetails/JavaScript.jpg",
    "courseDescription": "Our JavaScript course provides complete training in the world's most popular programming language. From fundamental concepts to modern frameworks, this course prepares you for frontend, backend, and full-stack development. The curriculum includes hands-on projects to build real-world web applications.",
    "section1": {
      "title": "JavaScript Course Content",
      "description": "The JavaScript syllabus covers ES6+ features, DOM manipulation, asynchronous programming, and popular frameworks like React and Node.js. You'll learn to build interactive web applications, work with APIs, and implement modern development workflows. The course emphasizes practical skills through project-based learning."
    },
    "section2": {
      "title": "Why JavaScript is Essential",
      "description": "JavaScript powers the modern web and continues to expand its reach with new technologies and frameworks. Mastering JavaScript opens doors to countless opportunities in web development and beyond.",
      "bulletPoints": [
        "Web Dominance: The only programming language native to browsers",
        "Full-Stack Capability: Frontend to backend with Node.js",
        "High Demand: Most commonly used programming language",
        "Vibrant Ecosystem: Countless frameworks and libraries",
        "Continuous Evolution: Regular updates with new features"
      ]
    },
    "section3": {
      "title": "JavaScript Career Paths",
      "description": "JavaScript skills can lead to diverse career opportunities including:",
      "bulletPoints": [
        "Frontend Developer",
        "Backend Developer",
        "Full Stack Developer",
        "React/Node.js Developer",
        "UI/UX Developer",
        "Web Application Developer",
        "Mobile App Developer (React Native)",
        "Game Developer",
        "DevOps Engineer"
      ]
    }
  },
  "PHP": {
    "courseImage": "/CourseDetails/PHP.jpg",
    "courseDescription": "Our PHP course provides comprehensive training in server-side web development. Designed for both beginners and experienced developers, this course covers PHP fundamentals, modern practices, and popular frameworks like Laravel. You'll learn to build dynamic, database-driven websites and web applications.",
    "section1": {
      "title": "PHP Course Content",
      "description": "The PHP curriculum includes syntax basics, object-oriented programming, MySQL integration, security practices, and MVC architecture. You'll work with Composer, build RESTful APIs, and deploy applications. The course emphasizes real-world projects including content management systems and e-commerce platforms."
    },
    "section2": {
      "title": "The PHP Advantage",
      "description": "PHP remains a cornerstone of web development, powering millions of websites including major platforms like WordPress and Facebook.",
      "bulletPoints": [
        "Web Specialization: Designed specifically for web development",
        "Wide Adoption: Powers 78% of all websites using server-side programming",
        "Performance: Continual improvements in speed and efficiency",
        "Cost-Effective: Open-source with low hosting requirements",
        "Strong CMS Ecosystem: WordPress, Drupal, Joomla, etc."
      ]
    },
    "section3": {
      "title": "PHP Career Opportunities",
      "description": "PHP developers are in constant demand for various web development roles:",
      "bulletPoints": [
        "PHP Developer",
        "WordPress Developer",
        "Backend Developer",
        "Full Stack Developer",
        "Web Application Developer",
        "E-commerce Developer",
        "CMS Specialist",
        "API Developer",
        "Technical Lead"
      ]
    }
  },

  "Full Stack Developer": {
    "courseImage": "/CourseDetails/FullStack.jpg",
    "courseDescription": "Our Full Stack Developer course provides end-to-end training in modern web development technologies. This comprehensive program covers both frontend and backend technologies, preparing you to build complete web applications from scratch. You'll master the entire development stack and learn to deploy production-ready applications.",
    "section1": {
      "title": "Full Stack Course Content",
      "description": "The Full Stack curriculum includes HTML5, CSS3, JavaScript, React.js for frontend development, and Node.js with Express for backend development. You'll learn database integration with MongoDB and SQL, RESTful API development, authentication systems, and deployment strategies. The course emphasizes real-world projects including e-commerce platforms and social media applications."
    },
    "section2": {
      "title": "Why Become a Full Stack Developer?",
      "description": "Full Stack Developers are among the most sought-after professionals in the tech industry, capable of handling all aspects of web application development.",
      "bulletPoints": [
        "High Demand: Companies prefer developers who can work on both client and server sides",
        "Versatile Skillset: Master both frontend and backend technologies",
        "Better Career Prospects: Higher salaries and more job opportunities",
        "End-to-End Understanding: See the big picture of how applications work",
        "Flexibility: Ability to work on diverse projects and technologies"
      ]
    },
    "section3": {
      "title": "Full Stack Career Opportunities",
      "description": "Full Stack skills can lead to various high-growth career paths:",
      "bulletPoints": [
        "Full Stack Developer",
        "Web Application Developer",
        "Frontend Developer (with backend knowledge)",
        "Backend Developer (with frontend knowledge)",
        "Technical Lead",
        "Solutions Architect",
        "Freelance Web Developer",
        "Startup Technical Founder",
        "DevOps Engineer"
      ]
    }
  },
  "ReactJS": {
    "courseImage": "/CourseDetails/ReactJS.jpg",
    "courseDescription": "Our ReactJS course provides comprehensive training in building modern, interactive user interfaces. You'll learn to create efficient, scalable frontend applications using React's component-based architecture. The course covers everything from React fundamentals to advanced concepts like hooks, context API, and state management.",
    "section1": {
      "title": "ReactJS Course Content",
      "description": "The ReactJS syllabus includes JSX syntax, components, props, state management, React hooks, routing with React Router, and integration with backend APIs. You'll learn to use modern tools like Redux for state management, Next.js for server-side rendering, and Material-UI for responsive design. The course includes multiple projects to build your portfolio."
    },
    "section2": {
      "title": "The ReactJS Advantage",
      "description": "React has become the most popular frontend library, powering thousands of high-traffic websites and applications worldwide.",
      "bulletPoints": [
        "Component-Based: Reusable UI components for efficient development",
        "Virtual DOM: Optimized rendering for better performance",
        "Strong Ecosystem: Rich collection of libraries and tools",
        "Backed by Facebook: Continuously maintained and improved",
        "High Job Demand: One of the most sought-after frontend skills"
      ]
    },
    "section3": {
      "title": "ReactJS Career Paths",
      "description": "ReactJS expertise opens doors to various frontend development roles:",
      "bulletPoints": [
        "React Developer",
        "Frontend Developer",
        "UI Developer",
        "JavaScript Developer",
        "Full Stack Developer (with backend knowledge)",
        "Mobile App Developer (React Native)",
        "Frontend Architect",
        "Technical Lead (Frontend)",
        "Freelance Web Developer"
      ]
    }
  },
  "Node.js": {
    "courseImage": "/CourseDetails/NodeJS.jpg",
    "courseDescription": "Our Node.js course provides in-depth training in server-side JavaScript development. You'll learn to build fast, scalable network applications using Node.js runtime environment. The course covers everything from basic concepts to advanced topics like microservices architecture and real-time applications.",
    "section1": {
      "title": "Node.js Course Content",
      "description": "The Node.js curriculum includes asynchronous programming, Express.js framework, REST API development, authentication with JWT, database integration with MongoDB and MySQL, and testing with Jest. You'll learn to build real-time applications with Socket.IO, create microservices, and deploy Node.js applications to cloud platforms."
    },
    "section2": {
      "title": "Why Learn Node.js?",
      "description": "Node.js has revolutionized backend development by enabling JavaScript on the server side, creating new possibilities for full stack JavaScript developers.",
      "bulletPoints": [
        "JavaScript Everywhere: Use the same language on frontend and backend",
        "High Performance: Non-blocking I/O for handling concurrent requests",
        "NPM Ecosystem: Largest collection of open-source packages",
        "Scalability: Ideal for building microservices and APIs",
        "Real-Time Capabilities: Perfect for chat apps, gaming, and collaboration tools"
      ]
    },
    "section3": {
      "title": "Node.js Career Opportunities",
      "description": "Node.js skills are valuable for various backend and full stack roles:",
      "bulletPoints": [
        "Node.js Developer",
        "Backend Developer",
        "Full Stack Developer",
        "API Developer",
        "DevOps Engineer",
        "Software Architect",
        "Technical Lead",
        "Real-Time Application Developer",
        "Microservices Specialist"
      ]
    }
  },
  "Microsoft Azure": {
    "courseImage": "/CourseDetails/Azure.jpg",
    "courseDescription": "Our Microsoft Azure course provides comprehensive training in cloud computing using Microsoft's powerful cloud platform. You'll learn to design, implement, and manage Azure solutions while preparing for Microsoft certification exams. The course covers infrastructure, platform services, security, and cloud architecture best practices.",
    "section1": {
      "title": "Azure Course Content",
      "description": "The Azure curriculum includes virtual machines, Azure Active Directory, storage solutions, networking, serverless computing, and DevOps on Azure. You'll work with Azure App Services, Functions, Kubernetes, and learn monitoring with Azure Monitor. The course includes hands-on labs with real Azure environments."
    },
    "section2": {
      "title": "Why Learn Microsoft Azure?",
      "description": "Azure is one of the fastest-growing cloud platforms with increasing enterprise adoption across industries.",
      "bulletPoints": [
        "Enterprise Adoption: Used by 95% of Fortune 500 companies",
        "Hybrid Cloud Leader: Seamless integration with on-premises systems",
        "Growing Demand: Over 100,000 Azure jobs available worldwide",
        "Microsoft Ecosystem: Tight integration with Windows, Office, and .NET",
        "Certification Path: Clear progression to Microsoft certifications"
      ]
    },
    "section3": {
      "title": "Azure Career Opportunities",
      "description": "Azure skills can lead to high-paying cloud roles including:",
      "bulletPoints": [
        "Azure Cloud Engineer",
        "Cloud Solutions Architect",
        "Azure DevOps Engineer",
        "Cloud Security Specialist",
        "Azure Data Engineer",
        "Cloud Administrator",
        "Infrastructure Engineer",
        "Cloud Consultant",
        "Enterprise Architect"
      ]
    }
  },
  "AWS": {
    "courseImage": "/CourseDetails/AWS.jpg",
    "courseDescription": "Our AWS course provides complete training in Amazon Web Services, the world's leading cloud platform. You'll gain hands-on experience with core AWS services while preparing for AWS certifications. The curriculum covers compute, storage, networking, security, and serverless architectures in the AWS cloud.",
    "section1": {
      "title": "AWS Course Content",
      "description": "The AWS syllabus includes EC2, S3, VPC, IAM, Lambda, RDS, CloudFormation, and more. You'll learn to deploy scalable applications, implement security best practices, and optimize costs. The course includes real-world projects like building highly available web applications and data pipelines on AWS."
    },
    "section2": {
      "title": "The AWS Advantage",
      "description": "AWS dominates the cloud market with the most comprehensive set of cloud services.",
      "bulletPoints": [
        "Market Leader: 33% share of the global cloud market",
        "Comprehensive Services: Over 200 fully featured services",
        "High Salaries: AWS-certified professionals earn 20-30% more",
        "Global Infrastructure: 84 availability zones worldwide",
        "Startup Friendly: Powers most tech startups and unicorns"
      ]
    },
    "section3": {
      "title": "AWS Career Paths",
      "description": "AWS expertise opens doors to lucrative cloud careers:",
      "bulletPoints": [
        "AWS Solutions Architect",
        "Cloud Engineer",
        "DevOps Engineer (AWS)",
        "Cloud Security Engineer",
        "Data Engineer (AWS)",
        "SysOps Administrator",
        "Cloud Consultant",
        "Site Reliability Engineer",
        "Technical Account Manager"
      ]
    }
  },
  "DevOps": {
    "courseImage": "/CourseDetails/DevOps.jpg",
    "courseDescription": "Our DevOps course provides end-to-end training in modern software delivery practices. You'll learn to bridge development and operations using cutting-edge tools and methodologies. The curriculum covers CI/CD pipelines, infrastructure as code, monitoring, and cloud-native architectures.",
    "section1": {
      "title": "DevOps Course Content",
      "description": "The DevOps program includes Docker, Kubernetes, Jenkins, Terraform, Ansible, Prometheus, and Grafana. You'll implement Git workflows, build automated pipelines, and deploy microservices. The course emphasizes real-world scenarios with hands-on labs simulating production environments."
    },
    "section2": {
      "title": "Why DevOps Matters",
      "description": "DevOps has revolutionized software delivery with faster releases and higher quality.",
      "bulletPoints": [
        "Industry Standard: Adopted by 83% of IT organizations",
        "Higher Salaries: DevOps engineers earn 25-35% more than traditional roles",
        "Future-Proof: Essential for cloud-native development",
        "Tool Mastery: Learn the most in-demand DevOps tools",
        "Cultural Shift: Learn collaborative ways of working"
      ]
    },
    "section3": {
      "title": "DevOps Career Opportunities",
      "description": "DevOps skills are valuable across the tech industry:",
      "bulletPoints": [
        "DevOps Engineer",
        "Site Reliability Engineer",
        "Platform Engineer",
        "Release Manager",
        "Automation Architect",
        "Cloud Engineer",
        "CI/CD Specialist",
        "Infrastructure Engineer",
        "Technical Operations Lead"
      ]
    }
  },
  "Cyber Security": {
    "courseImage": "/CourseDetails/CyberSecurity.jpg",
    "courseDescription": "Our Cyber Security course provides comprehensive training in protecting digital assets from threats. You'll learn defensive and offensive security techniques while preparing for industry certifications. The curriculum covers network security, ethical hacking, risk management, and compliance frameworks.",
    "section1": {
      "title": "Cyber Security Course Content",
      "description": "The program includes penetration testing, firewall configuration, SIEM tools, cryptography, and security auditing. You'll work with Kali Linux, Wireshark, Metasploit, and other security tools. The course includes simulated attacks and defense scenarios in a controlled lab environment."
    },
    "section2": {
      "title": "The Importance of Cyber Security",
      "description": "Cyber threats are growing exponentially, creating massive demand for security professionals.",
      "bulletPoints": [
        "Critical Need: 3.5 million unfilled cyber security jobs worldwide",
        "High Stakes: Global cybercrime damages exceed $6 trillion annually",
        "Diverse Specializations: Multiple career paths within security",
        "Continuous Learning: Ever-evolving threat landscape",
        "Mission-Driven: Protect organizations and society"
      ]
    },
    "section3": {
      "title": "Cyber Security Careers",
      "description": "Security skills lead to rewarding, high-impact roles:",
      "bulletPoints": [
        "Security Analyst",
        "Security Engineer",
        "SOC Analyst",
        "Vulnerability Assessor",
        "Security Architect",
        "GRC Consultant",
        "Forensic Investigator",
        "Security Operations Manager",
        "Chief Information Security Officer"
      ]
    }
  },
  "Ethical Hacking": {
    "courseImage": "/CourseDetails/EthicalHacking.jpg",
    "courseDescription": "Our Ethical Hacking course provides hands-on training in penetration testing and vulnerability assessment. You'll learn to think like a hacker to better defend systems, preparing for certifications like CEH and OSCP. The course covers reconnaissance, scanning, exploitation, and post-exploitation techniques.",
    "section1": {
      "title": "Ethical Hacking Course Content",
      "description": "The curriculum includes network penetration testing, web application hacking, wireless security, social engineering, and malware analysis. You'll use tools like Nmap, Burp Suite, John the Ripper, and Empire in controlled environments. The course culminates in capture-the-flag challenges."
    },
    "section2": {
      "title": "Why Become an Ethical Hacker?",
      "description": "Ethical hackers are the frontline defenders against cyber threats.",
      "bulletPoints": [
        "High Demand: 0% unemployment rate in cybersecurity",
        "Exciting Work: Constantly new challenges and puzzles",
        "Legal Hacking: Get paid to break systems (with permission)",
        "Certification Value: CEH holders earn 44% more",
        "Diverse Environments: Work across all industries"
      ]
    },
    "section3": {
      "title": "Ethical Hacking Careers",
      "description": "Hacking skills open unique security career paths:",
      "bulletPoints": [
        "Penetration Tester",
        "Red Team Operator",
        "Vulnerability Researcher",
        "Security Consultant",
        "Bug Bounty Hunter",
        "Malware Analyst",
        "Cyber Security Trainer",
        "Incident Responder",
        "Security Auditor"
      ]
    }
  },

  "Selenium": {
    "courseImage": "/CourseDetails/Selenium.jpg",
    "courseDescription": "Our Selenium course provides comprehensive training in automated web testing using the Selenium WebDriver. You'll learn to build robust test automation frameworks and implement continuous testing in DevOps pipelines. The curriculum covers cross-browser testing, parallel execution, and integration with popular testing tools.",
    "section1": {
      "title": "Selenium Course Content",
      "description": "The Selenium syllabus includes WebDriver architecture, locator strategies, test automation frameworks (TestNG, JUnit), Page Object Model, data-driven testing, and cross-browser testing. You'll learn to integrate Selenium with Jenkins for CI/CD pipelines and work with Selenium Grid for parallel execution."
    },
    "section2": {
      "title": "Why Learn Selenium?",
      "description": "Selenium is the industry standard for web automation testing with widespread adoption across organizations.",
      "bulletPoints": [
        "Industry Standard: Most popular open-source test automation tool",
        "Cross-Browser Testing: Verify functionality across browsers",
        "Language Support: Write tests in Java, Python, C#, etc.",
        "CI/CD Integration: Essential for DevOps pipelines",
        "High Demand: 72% of companies use Selenium for test automation"
      ]
    },
    "section3": {
      "title": "Selenium Career Opportunities",
      "description": "Selenium skills can lead to rewarding QA automation roles:",
      "bulletPoints": [
        "Automation Test Engineer",
        "QA Automation Developer",
        "SDET (Software Development Engineer in Test)",
        "Test Architect",
        "DevOps Test Engineer",
        "Quality Assurance Lead",
        "Test Automation Consultant",
        "Performance Test Engineer",
        "CI/CD Automation Specialist"
      ]
    }
  },
  "Manual Testing Course": {
    "courseImage": "/CourseDetails/ManualTesting.jpg",
    "courseDescription": "Our Manual Testing course provides fundamental training in software quality assurance principles and techniques. You'll learn to design test cases, execute manual tests, and report defects effectively. The curriculum covers all aspects of the software testing lifecycle with hands-on practice on real applications.",
    "section1": {
      "title": "Manual Testing Course Content",
      "description": "The course covers test planning, test case design techniques, defect lifecycle, test documentation, and various testing types (functional, regression, integration, system). You'll work with bug tracking tools like JIRA and learn agile testing methodologies."
    },
    "section2": {
      "title": "The Importance of Manual Testing",
      "description": "Manual testing remains crucial despite automation, especially for usability and exploratory testing.",
      "bulletPoints": [
        "Foundation for QA: Essential before learning automation",
        "User Perspective: Best for evaluating UX/UI aspects",
        "Early Career Entry: Common starting point in QA",
        "Complementary to Automation: Some tests must be manual",
        "Wide Applicability: Needed across all software domains"
      ]
    },
    "section3": {
      "title": "Manual Testing Career Paths",
      "description": "Manual testing skills open doors to various QA roles:",
      "bulletPoints": [
        "Manual Test Engineer",
        "QA Analyst",
        "Test Lead",
        "Quality Assurance Specialist",
        "Business Analyst (Testing)",
        "Application Tester",
        "Game Tester",
        "Mobile App Tester",
        "Test Coordinator"
      ]
    }
  },
  "ETL Testing": {
    "courseImage": "/CourseDetails/ETLTesting.jpg",
    "courseDescription": "Our ETL Testing course provides specialized training in data warehouse testing methodologies. You'll learn to validate data extraction, transformation and loading processes to ensure data integrity in BI systems. The curriculum covers SQL for testers, data quality checks, and ETL testing tools.",
    "section1": {
      "title": "ETL Testing Course Content",
      "description": "The course includes data warehouse concepts, ETL process validation, SQL queries for testing, data mapping verification, and performance testing of ETL jobs. You'll work with tools like Informatica, Talend, and SSIS while learning to automate data validation tests."
    },
    "section2": {
      "title": "Why ETL Testing Matters",
      "description": "ETL testing ensures accurate business decisions by verifying data quality in analytics systems.",
      "bulletPoints": [
        "BI Foundation: Critical for accurate reporting and analytics",
        "Data Integrity: Prevents costly business decisions from bad data",
        "Specialized Skill: Higher compensation than general testing",
        "Growing Demand: With increasing data warehouse adoption",
        "Automation Potential: Many repetitive checks can be automated"
      ]
    },
    "section3": {
      "title": "ETL Testing Career Opportunities",
      "description": "ETL testing expertise leads to specialized data QA roles:",
      "bulletPoints": [
        "ETL Test Engineer",
        "Data Quality Analyst",
        "BI Tester",
        "Data Warehouse Tester",
        "Database Test Specialist",
        "ETL Automation Engineer",
        "Data Migration Tester",
        "Analytics QA Lead",
        "Data Governance Specialist"
      ]
    }
  },
  "JMeter Course": {
    "courseImage": "/CourseDetails/JMeter.jpg",
    "courseDescription": "Our JMeter course provides hands-on training in performance and load testing using Apache JMeter. You'll learn to simulate heavy user loads, analyze performance metrics, and identify system bottlenecks. The curriculum covers web, API, and database performance testing with realistic scenarios.",
    "section1": {
      "title": "JMeter Course Content",
      "description": "The syllabus includes JMeter architecture, test plan creation, various samplers, listeners, controllers, and timers. You'll learn distributed testing, parameterization, correlation, and reporting. The course also covers advanced topics like BeanShell scripting and plugin management."
    },
    "section2": {
      "title": "The Power of JMeter",
      "description": "JMeter is the most popular open-source tool for performance testing with enterprise adoption.",
      "bulletPoints": [
        "Open-Source Advantage: Free with active community support",
        "Versatile: Test web, APIs, databases, and more",
        "Scalability: Simulate thousands of concurrent users",
        "CI/CD Integration: Run performance tests in pipelines",
        "Plugin Ecosystem: Extend functionality with plugins"
      ]
    },
    "section3": {
      "title": "JMeter Career Paths",
      "description": "JMeter skills are valuable for performance engineering roles:",
      "bulletPoints": [
        "Performance Test Engineer",
        "Load Test Specialist",
        "QA Performance Analyst",
        "DevOps Performance Engineer",
        "Application Performance Consultant",
        "Site Reliability Engineer",
        "Cloud Performance Architect",
        "Test Automation Engineer",
        "Technical Lead (Performance)"
      ]
    }
  },
  "LoadRunner": {
    "courseImage": "/CourseDetails/LoadRunner.jpg",
    "courseDescription": "Our LoadRunner course provides professional training in enterprise-grade performance testing using Micro Focus LoadRunner. You'll learn to design sophisticated load tests, analyze results, and optimize application performance. The curriculum covers protocol selection, scenario design, and advanced analysis techniques.",
    "section1": {
      "title": "LoadRunner Course Content",
      "description": "The course includes Virtual User Generator (VuGen), Controller, and Analysis modules. You'll learn to script for various protocols (Web HTTP/HTML, TruClient, Web Services), create realistic load scenarios, and interpret detailed performance graphs and reports."
    },
    "section2": {
      "title": "Why Learn LoadRunner?",
      "description": "LoadRunner remains the gold standard for enterprise performance testing.",
      "bulletPoints": [
        "Industry Standard: Used by Fortune 500 companies",
        "Enterprise Features: Supports complex testing scenarios",
        "Detailed Analytics: Comprehensive performance metrics",
        "Protocol Support: 50+ application protocols",
        "Career Value: LoadRunner skills command premium salaries"
      ]
    },
    "section3": {
      "title": "LoadRunner Career Opportunities",
      "description": "LoadRunner expertise opens doors to high-value performance roles:",
      "bulletPoints": [
        "Performance Test Lead",
        "Load Test Architect",
        "Enterprise Performance Engineer",
        "Application Performance Analyst",
        "Technical Consultant (Performance)",
        "QA Manager (Performance Testing)",
        "Cloud Performance Specialist",
        "SRE (Performance Focus)",
        "Pre-Sales Engineer (Testing Tools)"
      ]
    }
  },
  "SoapUI": {
    "courseImage": "/CourseDetails/SoapUI.jpg",
    "courseDescription": "Our SoapUI course provides comprehensive training in API testing using the SoapUI tool. You'll learn to test REST and SOAP web services, automate API tests, and implement service virtualization. The curriculum covers functional testing, security testing, and performance testing of APIs.",
    "section1": {
      "title": "SoapUI Course Content",
      "description": "The syllabus includes SoapUI project creation, REST and SOAP service testing, assertions, test suites, data-driven testing, and Groovy scripting. You'll learn to automate API tests, mock services, and integrate with CI/CD pipelines. The course also covers ReadyAPI features for advanced testing."
    },
    "section2": {
      "title": "The SoapUI Advantage",
      "description": "SoapUI is the most popular tool for API testing with comprehensive features.",
      "bulletPoints": [
        "API Specialization: Designed specifically for web services",
        "Dual Protocol: Supports both REST and SOAP",
        "Test Automation: Create robust API test suites",
        "Service Virtualization: Mock services for testing",
        "Integration Friendly: Works with CI/CD tools"
      ]
    },
    "section3": {
      "title": "SoapUI Career Paths",
      "description": "SoapUI skills are valuable for API testing and development roles:",
      "bulletPoints": [
        "API Test Engineer",
        "Web Services Tester",
        "Automation Engineer (API)",
        "Quality Assurance Analyst (API)",
        "DevOps Engineer (API Testing)",
        "Backend Developer (Testing Focus)",
        "Technical Consultant (API)",
        "Integration Test Specialist",
        "Test Architect (API)"
      ]
    }
  },
  "Data Science Course": {
    "courseImage": "/CourseDetails/DataScience.jpg",
    "courseDescription": "Our Data Science course provides end-to-end training in extracting insights from data. You'll master Python for data analysis, machine learning algorithms, and data visualization techniques. The curriculum covers the complete data science workflow from data cleaning to model deployment.",
    "section1": {
      "title": "Data Science Course Content",
      "description": "The course includes Python programming, pandas, NumPy, data visualization with Matplotlib and Seaborn, machine learning with scikit-learn, and introduction to deep learning. You'll work on real-world projects involving data cleaning, exploratory data analysis, feature engineering, and model building."
    },
    "section2": {
      "title": "Why Learn Data Science?",
      "description": "Data Science is transforming industries by turning data into actionable insights.",
      "bulletPoints": [
        "High Demand: #1 job in America (Glassdoor)",
        "Lucrative Salaries: Average $120,000+ in US",
        "Cross-Industry: Applicable to all sectors",
        "Future-Proof: Growing data needs across organizations",
        "Problem-Solving: Tackle complex business challenges"
      ]
    },
    "section3": {
      "title": "Data Science Career Opportunities",
      "description": "Data Science skills open doors to exciting roles:",
      "bulletPoints": [
        "Data Scientist",
        "Machine Learning Engineer",
        "Data Analyst",
        "Business Intelligence Analyst",
        "AI Specialist",
        "Research Scientist",
        "Data Engineer",
        "Quantitative Analyst",
        "Chief Data Officer"
      ]
    }
  },
  "Artificial Intelligence": {
    "courseImage": "/CourseDetails/AI.jpg",
    "courseDescription": "Our Artificial Intelligence course provides cutting-edge training in AI technologies. You'll learn machine learning, deep learning, neural networks, and AI application development. The curriculum combines theoretical foundations with hands-on projects using TensorFlow and PyTorch.",
    "section1": {
      "title": "AI Course Content",
      "description": "The syllabus includes supervised/unsupervised learning, neural networks, CNN, RNN, NLP, computer vision, and reinforcement learning. You'll implement AI models for image recognition, text processing, and predictive analytics. The course also covers AI ethics and deployment strategies."
    },
    "section2": {
      "title": "The AI Revolution",
      "description": "AI is transforming every industry with intelligent automation and decision-making.",
      "bulletPoints": [
        "Industry Transformation: Changing healthcare, finance, manufacturing etc.",
        "High Growth: AI market to reach $500 billion by 2024",
        "Cutting-Edge Tech: Work with latest advancements",
        "Research Opportunities: Contribute to advancing AI",
        "Global Impact: Solve complex societal problems"
      ]
    },
    "section3": {
      "title": "AI Career Paths",
      "description": "AI expertise leads to futuristic technology roles:",
      "bulletPoints": [
        "AI Engineer",
        "Machine Learning Specialist",
        "Deep Learning Engineer",
        "NLP Engineer",
        "Computer Vision Engineer",
        "AI Research Scientist",
        "AI Product Manager",
        "Robotics Engineer",
        "Chief AI Officer"
      ]
    }
  },

  "Digital Marketing": {
    "courseImage": "/CourseDetails/DigitalMarketing.jpg",
    "courseDescription": "Our Digital Marketing course provides comprehensive training in all aspects of online marketing strategies. You'll master SEO, social media marketing, PPC advertising, content marketing, email marketing, and analytics. The curriculum combines theoretical knowledge with hands-on projects using real-world tools and platforms.",
    "section1": {
      "title": "Digital Marketing Course Content",
      "description": "The course covers search engine optimization (SEO), Google Ads, Facebook/Instagram advertising, Google Analytics, content strategy, email marketing automation, and conversion rate optimization. You'll work with tools like Google Search Console, SEMrush, Mailchimp, and Hootsuite while developing complete digital marketing campaigns."
    },
    "section2": {
      "title": "Why Learn Digital Marketing?",
      "description": "Digital marketing skills are essential in today's online-first business landscape.",
      "bulletPoints": [
        "High Demand: Every business needs digital marketing expertise",
        "Diverse Skillset: Master multiple high-value marketing disciplines",
        "Performance-Based: Measurable results and ROI",
        "Flexible Career: Work in-house, agency, or freelance",
        "Constant Evolution: Always new platforms and techniques to master"
      ]
    },
    "section3": {
      "title": "Digital Marketing Career Opportunities",
      "description": "Digital marketing skills open doors to various exciting roles:",
      "bulletPoints": [
        "Digital Marketing Specialist",
        "SEO/SEM Manager",
        "Social Media Manager",
        "Content Marketing Manager",
        "PPC Specialist",
        "Email Marketing Manager",
        "Digital Strategist",
        "Growth Hacker",
        "Chief Marketing Officer (Digital)"
      ]
    }
  },
  "Excel": {
    "courseImage": "/CourseDetails/Excel.jpg",
    "courseDescription": "Our Excel course provides comprehensive training in data analysis and business productivity using Microsoft Excel. You'll progress from basic functions to advanced data modeling, automation, and visualization techniques. The curriculum is designed for professionals across all industries who need to work efficiently with data.",
    "section1": {
      "title": "Excel Course Content",
      "description": "The syllabus includes formulas and functions, pivot tables, data validation, advanced charts, Power Query, macros with VBA, and dashboard creation. You'll learn financial modeling, statistical analysis, and how to connect Excel with databases and other data sources for powerful business intelligence solutions."
    },
    "section2": {
      "title": "The Power of Excel",
      "description": "Excel remains the most widely used business productivity tool worldwide.",
      "bulletPoints": [
        "Universal Application: Used in every industry and department",
        "Career Essential: Required skill for many professional roles",
        "Data Analysis: Powerful tools for business intelligence",
        "Automation: Save hours with macros and scripting",
        "Certification Value: Microsoft Office Specialist credentials"
      ]
    },
    "section3": {
      "title": "Excel Career Applications",
      "description": "Advanced Excel skills enhance these professional roles:",
      "bulletPoints": [
        "Financial Analyst",
        "Business Analyst",
        "Data Analyst",
        "Operations Manager",
        "Accountant",
        "Marketing Analyst",
        "HR Specialist",
        "Project Manager",
        "Executive Assistant"
      ]
    }
  },

  "C Sharp": {
    "courseImage": "/CourseDetails/CSharp.jpg",
    "courseDescription": "Our C# course provides comprehensive training in Microsoft's versatile programming language. You'll learn to build robust applications for Windows, web, and mobile platforms using the .NET framework. The curriculum covers object-oriented programming, LINQ, asynchronous programming, and modern C# features.",
    "section1": {
      "title": "C# Course Content",
      "description": "The syllabus includes C# syntax, OOP principles, exception handling, delegates/events, generics, LINQ, async/await, and .NET Core fundamentals. You'll build desktop applications with WPF, web services with ASP.NET, and learn to work with databases using Entity Framework."
    },
    "section2": {
      "title": "Why Learn C#?",
      "description": "C# is a powerful, versatile language with strong Microsoft backing and wide enterprise adoption.",
      "bulletPoints": [
        "Enterprise Standard: Widely used in business applications",
        "Cross-Platform: With .NET Core runs on Windows, Linux, macOS",
        "Game Development: Primary language for Unity game engine",
        "Strong Typing: Reduces runtime errors",
        "Growing Ecosystem: Continuous improvements from Microsoft"
      ]
    },
    "section3": {
      "title": "C# Career Opportunities",
      "description": "C# skills can lead to various development roles:",
      "bulletPoints": [
        "C# Developer",
        ".NET Developer",
        "Unity Developer",
        "Backend Developer",
        "Full Stack Developer (.NET)",
        "Software Engineer",
        "Application Developer",
        "Cloud Developer (Azure)",
        "Technical Architect"
      ]
    }
  },
  "UNIX Shell Scripting": {
    "courseImage": "/CourseDetails/UNIXShell.jpg",
    "courseDescription": "Our UNIX Shell Scripting course provides hands-on training in automating tasks and system administration using shell commands and scripts. You'll learn to write efficient scripts to manage files, processes, and system resources across UNIX/Linux environments.",
    "section1": {
      "title": "UNIX Shell Scripting Course Content",
      "description": "The course covers bash shell programming, file manipulation, text processing with grep/awk/sed, process management, regular expressions, and advanced scripting techniques. You'll learn to automate system administration tasks, create cron jobs, and write robust production scripts."
    },
    "section2": {
      "title": "The Power of Shell Scripting",
      "description": "Shell scripting is an essential skill for system administrators and developers working in UNIX/Linux environments.",
      "bulletPoints": [
        "System Administration: Automate repetitive tasks",
        "Developer Productivity: Streamline development workflows",
        "Server Management: Essential for managing Linux servers",
        "Lightweight Automation: No additional dependencies needed",
        "Cross-Platform: Skills transfer across UNIX-like systems"
      ]
    },
    "section3": {
      "title": "Shell Scripting Career Applications",
      "description": "Shell scripting skills enhance these technical roles:",
      "bulletPoints": [
        "Linux System Administrator",
        "DevOps Engineer",
        "Site Reliability Engineer",
        "Cloud Engineer",
        "Backend Developer",
        "Data Engineer",
        "Security Engineer",
        "Database Administrator",
        "Technical Support Engineer"
      ]
    }
  },
  "Workday HCM": {
    "courseImage": "/CourseDetails/WorkdayHCM.jpg",
    "courseDescription": "Our Workday HCM course provides comprehensive training in the leading cloud-based human capital management system. You'll learn to configure, implement, and manage Workday HCM solutions while understanding core HR processes and best practices.",
    "section1": {
      "title": "Workday HCM Course Content",
      "description": "The curriculum covers Workday architecture, organizational structures, business processes, security configuration, reporting, and integrations. You'll gain hands-on experience with core HCM modules including recruitment, compensation, talent management, and workforce planning."
    },
    "section2": {
      "title": "Why Learn Workday HCM?",
      "description": "Workday skills are in high demand as enterprises adopt cloud HCM solutions.",
      "bulletPoints": [
        "Market Leader: Growing adoption in large enterprises",
        "Cloud Expertise: Valuable SaaS implementation skills",
        "Career Growth: High demand for Workday professionals",
        "Certification Path: Workday offers official certifications",
        "Cross-Functional: Combines HR knowledge with technical skills"
      ]
    },
    "section3": {
      "title": "Workday HCM Career Paths",
      "description": "Workday skills can lead to specialized HR technology roles:",
      "bulletPoints": [
        "Workday HCM Consultant",
        "Workday Analyst",
        "HRIS Manager",
        "Workday Integration Specialist",
        "Workday Reporting Specialist",
        "Workday Security Administrator",
        "HR Technology Consultant",
        "Workday Project Manager",
        "Workday Architect"
      ]
    }
  },
  "Salesforce Online Training": {
    "courseImage": "/CourseDetails/SalesforceOnline.jpg",
    "courseDescription": "Our Salesforce Online Training provides flexible, comprehensive learning of the Salesforce platform. You'll master CRM configuration, customization, and administration through interactive online modules, virtual labs, and instructor-led sessions.",
    "section1": {
      "title": "Salesforce Online Course Content",
      "description": "The online curriculum covers Sales Cloud, Service Cloud, Lightning Experience, security models, process automation, reports/dashboards, and basic administration. The program includes hands-on exercises in a sandbox environment and preparation for Salesforce certification exams."
    },
    "section2": {
      "title": "Benefits of Online Salesforce Training",
      "description": "Online learning provides flexibility while delivering comprehensive Salesforce knowledge.",
      "bulletPoints": [
        "Flexible Schedule: Learn at your own pace",
        "Remote Access: No geographic limitations",
        "Hands-on Practice: Virtual lab environments",
        "Cost-Effective: Lower than in-person training",
        "Community Support: Access to online forums and groups"
      ]
    },
    "section3": {
      "title": "Salesforce Online Career Outcomes",
      "description": "Online training can lead to the same Salesforce career opportunities:",
      "bulletPoints": [
        "Remote Salesforce Administrator",
        "Virtual Salesforce Consultant",
        "Online Business Analyst",
        "Freelance Salesforce Developer",
        "Cloud CRM Specialist",
        "Salesforce Support Engineer",
        "Marketing Cloud Specialist",
        "Sales Operations Analyst",
        "Customer Success Manager"
      ]
    }
  },
  "Salesforce Developer": {
    "courseImage": "/CourseDetails/SalesforceDev.jpg",
    "courseDescription": "Our Salesforce Developer course provides in-depth training in building custom applications on the Salesforce platform. You'll learn Apex programming, Lightning Web Components, and integration techniques to extend Salesforce functionality.",
    "section1": {
      "title": "Salesforce Developer Course Content",
      "description": "The syllabus includes Apex classes/triggers, SOQL/SOSL, Lightning Component framework, Visualforce, REST/SOAP APIs, and deployment tools. You'll build custom applications, integrate with external systems, and follow Salesforce development best practices."
    },
    "section2": {
      "title": "Why Become a Salesforce Developer?",
      "description": "Salesforce Developers combine programming skills with platform expertise for high-demand roles.",
      "bulletPoints": [
        "Specialized Skillset: Combines coding with CRM knowledge",
        "High Earning Potential: Premium salaries for developers",
        "Platform Growth: Expanding Salesforce ecosystem",
        "Certification Path: Platform Developer I & II credentials",
        "Remote Opportunities: Many developer roles are location-independent"
      ]
    },
    "section3": {
      "title": "Salesforce Developer Careers",
      "description": "Developer skills open advanced technical roles:",
      "bulletPoints": [
        "Salesforce Developer",
        "Lightning Web Component Specialist",
        "Salesforce Architect",
        "Integration Developer",
        "Technical Consultant",
        "Application Engineer",
        "Solution Engineer",
        "Lead Developer",
        "CTO (Salesforce Practice)"
      ]
    }
  },
  "Azure DevOps": {
    "courseImage": "/CourseDetails/AzureDevOps.jpg",
    "courseDescription": "Our Azure DevOps course provides comprehensive training in Microsoft's cloud-based DevOps platform. You'll learn to implement CI/CD pipelines, manage code repositories, automate infrastructure, and monitor applications using Azure DevOps services.",
    "section1": {
      "title": "Azure DevOps Course Content",
      "description": "The curriculum covers Azure Repos, Pipelines, Boards, Test Plans, and Artifacts. You'll implement infrastructure as code with ARM templates, automate builds/releases, configure monitoring, and apply DevOps best practices in Azure environments."
    },
    "section2": {
      "title": "The Azure DevOps Advantage",
      "description": "Azure DevOps integrates seamlessly with Microsoft's cloud platform for end-to-end solutions.",
      "bulletPoints": [
        "Microsoft Integration: Tight coupling with Azure cloud",
        "Comprehensive Toolchain: All DevOps functions in one platform",
        "Enterprise Adoption: Widely used in Microsoft shops",
        "Hybrid Support: Works with on-prem and cloud resources",
        "Scalability: Handles large enterprise projects"
      ]
    },
    "section3": {
      "title": "Azure DevOps Career Paths",
      "description": "Azure DevOps skills are valuable for cloud engineering roles:",
      "bulletPoints": [
        "Azure DevOps Engineer",
        "Cloud Architect",
        "Release Manager",
        "Site Reliability Engineer",
        "Build Engineer",
        "Automation Specialist",
        "Technical Lead",
        "Infrastructure Engineer",
        "CI/CD Consultant"
      ]
    }
  },
  "Angular": {
    "courseImage": "/CourseDetails/Angular.jpg",
    "courseDescription": "Our Angular course provides comprehensive training in building modern web applications with Google's powerful frontend framework. You'll learn to create dynamic, single-page applications using components, services, and Angular's declarative templates.",
    "section1": {
      "title": "Angular Course Content",
      "description": "The syllabus includes TypeScript fundamentals, components, directives, services, dependency injection, routing, forms, HTTP client, and state management. You'll work with Angular CLI, learn testing strategies, and deploy production-ready applications."
    },
    "section2": {
      "title": "Why Learn Angular?",
      "description": "Angular is a complete framework preferred by enterprises for large-scale applications.",
      "bulletPoints": [
        "Enterprise Standard: Used by Fortune 500 companies",
        "Full-Featured: Built-in solutions for common needs",
        "Type Safety: TypeScript reduces runtime errors",
        "Google Backed: Strong corporate support",
        "Long-Term Support: Major version updates every 6 months"
      ]
    },
    "section3": {
      "title": "Angular Career Opportunities",
      "description": "Angular skills can lead to specialized frontend roles:",
      "bulletPoints": [
        "Angular Developer",
        "Frontend Engineer",
        "Full Stack Developer",
        "UI Developer",
        "JavaScript Architect",
        "Technical Lead (Frontend)",
        "Web Application Developer",
        "Enterprise Application Developer",
        "Freelance Web Developer"
      ]
    }
  },
  "WordPress": {
    "courseImage": "/CourseDetails/WordPress.jpg",
    "courseDescription": "Our WordPress course provides complete training in building and managing websites using the world's most popular CMS. You'll learn theme development, plugin customization, security best practices, and performance optimization for professional WordPress sites.",
    "section1": {
      "title": "WordPress Course Content",
      "description": "The curriculum covers WordPress installation, theme customization, plugin development, WooCommerce, security hardening, SEO optimization, and multisite management. You'll build complete websites while learning PHP, HTML/CSS, and JavaScript as they relate to WordPress."
    },
    "section2": {
      "title": "The WordPress Advantage",
      "description": "WordPress powers over 40% of all websites, creating massive demand for skilled developers.",
      "bulletPoints": [
        "Market Dominance: Most popular CMS worldwide",
        "Ecosystem: Thousands of themes and plugins",
        "Career Flexibility: Work for agencies, freelance, or in-house",
        "Low Barrier to Entry: Easy to start, room to grow",
        "Continuous Demand: Ongoing need for WordPress skills"
      ]
    },
    "section3": {
      "title": "WordPress Career Paths",
      "description": "WordPress skills open various web development opportunities:",
      "bulletPoints": [
        "WordPress Developer",
        "Theme Developer",
        "Plugin Developer",
        "Web Designer",
        "Content Manager",
        "E-commerce Developer (WooCommerce)",
        "Digital Marketing Specialist",
        "Technical Support Engineer",
        "Web Agency Owner"
      ]
    }
  },
  "CSS Online": {
    "courseImage": "/CourseDetails/CSSOnline.jpg",
    "courseDescription": "Our CSS Online course provides flexible, comprehensive training in modern web styling techniques. You'll master responsive design, CSS3 features, Flexbox, Grid, animations, and preprocessors through interactive online modules and hands-on projects.",
    "section1": {
      "title": "CSS Online Course Content",
      "description": "The online curriculum covers selectors, box model, positioning, media queries, transitions, transforms, Sass/SCSS, BEM methodology, and accessibility. You'll build responsive layouts, create animations, and learn to work with design systems in a virtual learning environment."
    },
    "section2": {
      "title": "Benefits of Learning CSS Online",
      "description": "Online CSS training offers convenience without compromising quality.",
      "bulletPoints": [
        "Self-Paced Learning: Study on your schedule",
        "Immediate Application: Practice on real projects",
        "Visual Learning: Perfect for design-related skills",
        "Cost-Effective: Affordable training option",
        "Community Access: Online forums and peer feedback"
      ]
    },
    "section3": {
      "title": "CSS Online Career Applications",
      "description": "CSS skills enhance these web-related roles:",
      "bulletPoints": [
        "Frontend Developer",
        "Web Designer",
        "UI Developer",
        "UX Designer",
        "Email Developer",
        "Theme Designer",
        "Digital Designer",
        "Web Content Manager",
        "Freelance Web Professional"
      ]
    }
  },
  "Machine Learning": {
    "courseImage": "/CourseDetails/ML.jpg",
    "courseDescription": "Our Machine Learning course provides comprehensive training in algorithms, statistical models, and data patterns that enable computers to improve through experience. You'll learn supervised and unsupervised learning techniques, neural networks, and model evaluation methods.",
    "section1": {
      "title": "Machine Learning Course Content",
      "description": "The syllabus includes regression, classification, clustering, dimensionality reduction, ensemble methods, and deep learning fundamentals. You'll work with scikit-learn, TensorFlow, and PyTorch while learning data preprocessing, feature engineering, and model deployment strategies."
    },
    "section2": {
      "title": "Why Learn Machine Learning?",
      "description": "ML is transforming industries with intelligent automation and predictive capabilities.",
      "bulletPoints": [
        "Industry Transformation: Changing healthcare, finance, retail, etc.",
        "High Salaries: Among top-paying tech skills",
        "Research Opportunities: Cutting-edge innovations",
        "Cross-Disciplinary: Applications across all domains",
        "Future-Proof: Growing demand across sectors"
      ]
    },
    "section3": {
      "title": "Machine Learning Careers",
      "description": "ML skills lead to advanced data science roles:",
      "bulletPoints": [
        "Machine Learning Engineer",
        "Data Scientist",
        "AI Specialist",
        "Research Scientist",
        "Computer Vision Engineer",
        "NLP Engineer",
        "Predictive Modeler",
        "Quantitative Analyst",
        "Chief Data Scientist"
      ]
    }
  },
  "Data Science With Python": {
    "courseImage": "/CourseDetails/DSPython.jpg",
    "courseDescription": "Our Data Science with Python course provides specialized training in analyzing and visualizing data using Python's powerful ecosystem. You'll master pandas for data manipulation, NumPy for numerical computing, and Matplotlib/Seaborn for visualization while learning statistical analysis techniques.",
    "section1": {
      "title": "Data Science with Python Course Content",
      "description": "The curriculum covers data cleaning, exploratory data analysis, statistical modeling, machine learning basics, and data visualization. You'll work with Jupyter Notebooks, learn to handle real-world datasets, and communicate insights effectively through data storytelling."
    },
    "section2": {
      "title": "Python for Data Science Advantage",
      "description": "Python is the leading language for data science due to its rich ecosystem.",
      "bulletPoints": [
        "Ecosystem Richness: pandas, NumPy, scikit-learn, etc.",
        "Versatility: From analysis to production deployment",
        "Community Support: Extensive resources and libraries",
        "Industry Standard: Used by 75% of data scientists",
        "Integration: Works with big data tools and databases"
      ]
    },
    "section3": {
      "title": "Data Science Python Careers",
      "description": "These roles benefit from Python data science skills:",
      "bulletPoints": [
        "Data Scientist (Python)",
        "Data Analyst",
        "Business Intelligence Analyst",
        "Quantitative Researcher",
        "Machine Learning Engineer",
        "Data Engineer",
        "Research Scientist",
        "Analytics Consultant",
        "Chief Analytics Officer"
      ]
    }
  },
  "Machine Learning with Python": {
    "courseImage": "/CourseDetails/MLPython.jpg",
    "courseDescription": "Our Machine Learning with Python course provides hands-on training in implementing ML algorithms using Python's scientific stack. You'll learn to build, evaluate, and deploy machine learning models using scikit-learn, TensorFlow, and other Python libraries.",
    "section1": {
      "title": "ML with Python Course Content",
      "description": "The syllabus includes supervised learning (regression, classification), unsupervised learning (clustering, dimensionality reduction), neural networks, model evaluation, hyperparameter tuning, and ML pipelines. You'll work on real datasets and learn to productionize models."
    },
    "section2": {
      "title": "Python's ML Ecosystem",
      "description": "Python offers the most comprehensive tools for machine learning implementation.",
      "bulletPoints": [
        "scikit-learn: Comprehensive traditional ML library",
        "TensorFlow/PyTorch: Leading deep learning frameworks",
        "Integration: Works with data processing and visualization tools",
        "Deployment: Flask/Django for model APIs",
        "Community: Largest ML community support"
      ]
    },
    "section3": {
      "title": "ML Python Career Paths",
      "description": "Python ML skills are essential for these roles:",
      "bulletPoints": [
        "Machine Learning Engineer (Python)",
        "Data Scientist",
        "AI Developer",
        "Research Engineer",
        "Computer Vision Engineer",
        "NLP Specialist",
        "Predictive Analytics Developer",
        "Quantitative Developer",
        "ML Ops Engineer"
      ]
    }
  },
  "Machine Learning using R": {
    "courseImage": "/CourseDetails/MLR.jpg",
    "courseDescription": "Our Machine Learning using R course provides specialized training in statistical learning techniques using the R programming language. You'll learn to implement ML algorithms with R's extensive packages, focusing on model interpretation and statistical rigor.",
    "section1": {
      "title": "ML with R Course Content",
      "description": "The curriculum covers caret package for model training, statistical learning methods, model evaluation, feature selection, and ensemble methods. You'll work with RStudio, learn to visualize model performance, and apply techniques to research-quality statistical analysis."
    },
    "section2": {
      "title": "R for Statistical Machine Learning",
      "description": "R is preferred for ML applications requiring rigorous statistical analysis.",
      "bulletPoints": [
        "Statistical Focus: Strong theoretical foundations",
        "Research Quality: Preferred in academia and research",
        "Reproducibility: RMarkdown for documented analysis",
        "Specialized Packages: Wide range of statistical ML packages",
        "Data Visualization: ggplot2 for model insights"
      ]
    },
    "section3": {
      "title": "ML with R Career Opportunities",
      "description": "R ML skills are valuable in these domains:",
      "bulletPoints": [
        "Statistical Modeler",
        "Research Scientist",
        "Biostatistician",
        "Quantitative Analyst (Finance)",
        "Epidemiologist",
        "Social Science Researcher",
        "Marketing Analytics Specialist",
        "Healthcare Data Scientist",
        "Academic Researcher"
      ]
    }
  },
  "MySQL": {
    "courseImage": "/CourseDetails/MySQL.jpg",
    "courseDescription": "Our MySQL course provides comprehensive training in the world's most popular open-source relational database. You'll learn database design, SQL programming, administration, and performance optimization for web and application development.",
    "section1": {
      "title": "MySQL Course Content",
      "description": "The syllabus includes database design principles, SQL queries, joins, subqueries, views, stored procedures, triggers, indexes, transactions, and security. You'll learn to optimize queries, configure MySQL servers, and implement backup/recovery strategies."
    },
    "section2": {
      "title": "Why Learn MySQL?",
      "description": "MySQL remains the database of choice for web applications and is part of the LAMP stack.",
      "bulletPoints": [
        "Open-Source: Free with commercial support options",
        "High Performance: Handles large-scale applications",
        "Web Standard: Powers most dynamic websites",
        "Cloud Ready: Available on all major cloud platforms",
        "Career Value: Foundational database skill"
      ]
    },
    "section3": {
      "title": "MySQL Career Applications",
      "description": "MySQL skills enhance these technical roles:",
      "bulletPoints": [
        "Database Administrator",
        "Backend Developer",
        "Full Stack Developer",
        "Data Analyst",
        "Business Intelligence Developer",
        "DevOps Engineer",
        "Application Developer",
        "ETL Developer",
        "Systems Architect"
      ]
    }
  },
  "SQL with PHP": {
    "courseImage": "/CourseDetails/SQLPHP.jpg",
    "courseDescription": "Our SQL with PHP course provides integrated training in database-driven web development. You'll learn to design databases and build dynamic web applications that interact with MySQL databases using PHP's database connectivity features.",
    "section1": {
      "title": "SQL with PHP Course Content",
      "description": "The curriculum covers MySQL database design, SQL queries, PHP data objects (PDO), prepared statements, CRUD operations, and security best practices. You'll build complete database-driven applications while learning to prevent SQL injection and optimize database interactions."
    },
    "section2": {
      "title": "The PHP/SQL Combination",
      "description": "PHP and SQL form the backbone of dynamic web development in the LAMP stack.",
      "bulletPoints": [
        "Web Standard: Foundation of many CMS and web apps",
        "Practical Skills: Build database applications quickly",
        "Career Foundation: Essential for web development roles",
        "Cost-Effective: Open-source technologies",
        "Wide Hosting Support: Available on all web hosts"
      ]
    },
    "section3": {
      "title": "PHP/SQL Career Paths",
      "description": "These web development roles require SQL with PHP skills:",
      "bulletPoints": [
        "PHP Developer",
        "Web Application Developer",
        "Full Stack Developer (LAMP)",
        "CMS Developer (WordPress, Drupal, etc.)",
        "Backend Developer",
        "Database-Driven App Developer",
        "Technical Support Engineer",
        "Freelance Web Developer",
        "IT Consultant"
      ]
    }
  },
  "Microsoft Dynamics 365": {
    "courseImage": "/CourseDetails/Dynamics365.jpg",
    "courseDescription": "Our Microsoft Dynamics 365 course provides comprehensive training in Microsoft's enterprise CRM and ERP cloud solutions. You'll learn to configure, customize, and administer Dynamics 365 applications for sales, customer service, marketing, and operations.",
    "section1": {
      "title": "Dynamics 365 Course Content",
      "description": "The syllabus covers core modules (Sales, Customer Service, Marketing, Field Service), Power Platform integration, security models, workflow automation, reporting, and basic customization. You'll work with real Dynamics 365 environments to implement business solutions."
    },
    "section2": {
      "title": "Why Learn Dynamics 365?",
      "description": "Dynamics 365 skills are in high demand as enterprises adopt Microsoft's cloud business applications.",
      "bulletPoints": [
        "Enterprise Adoption: Growing implementation in large organizations",
        "Microsoft Ecosystem: Integrates with Office 365, Azure, etc.",
        "Career Growth: High demand for Dynamics professionals",
        "Certification Path: Microsoft offers role-based certifications",
        "Dual Expertise: Combines business process with technical skills"
      ]
    },
    "section3": {
      "title": "Dynamics 365 Career Opportunities",
      "description": "Dynamics skills can lead to specialized roles:",
      "bulletPoints": [
        "Dynamics 365 Consultant",
        "CRM Functional Consultant",
        "ERP Analyst",
        "Business Applications Specialist",
        "Dynamics 365 Developer",
        "Technical Architect",
        "Solution Engineer",
        "Customer Engagement Manager",
        "Product Manager (Business Apps)"
      ]
    }
  },
  "Microsoft Excel": {
    "courseImage": "/CourseDetails/Excel.jpg",
    "courseDescription": "Our Microsoft Excel course provides comprehensive training in spreadsheet analysis and business productivity. You'll progress from basic functions to advanced data manipulation, analysis, and visualization techniques used by business professionals worldwide.",
    "section1": {
      "title": "Excel Course Content",
      "description": "The syllabus includes formulas/functions, pivot tables, data validation, lookup functions, conditional formatting, charts/graphs, data analysis tools, and introductory macros. You'll learn to clean, analyze, and present data effectively for business decision-making."
    },
    "section2": {
      "title": "Excel's Business Importance",
      "description": "Excel remains the most widely used business tool across all industries and functions.",
      "bulletPoints": [
        "Universal Application: Used in every business department",
        "Career Essential: Required skill for many professional roles",
        "Data Analysis: Foundation for business intelligence",
        "Reporting: Standard for financial and operational reports",
        "Certification Value: MOS certification enhances resumes"
      ]
    },
    "section3": {
      "title": "Excel Career Applications",
      "description": "Advanced Excel skills benefit these professional roles:",
      "bulletPoints": [
        "Financial Analyst",
        "Business Analyst",
        "Accountant",
        "Project Manager",
        "Marketing Analyst",
        "Operations Manager",
        "HR Specialist",
        "Sales Analyst",
        "Executive Assistant"
      ]
    }
  },
  "Excel Macros and VBA": {
    "courseImage": "/CourseDetails/ExcelVBA.jpg",
    "courseDescription": "Our Excel Macros and VBA course provides specialized training in automating Excel tasks using Visual Basic for Applications. You'll learn to create macros, write VBA code, and build custom functions to streamline repetitive tasks and enhance Excel's capabilities.",
    "section1": {
      "title": "Excel VBA Course Content",
      "description": "The curriculum covers macro recorder, VBA editor, variables/loops, user forms, error handling, event procedures, and advanced automation techniques. You'll build practical solutions like automated reports, data processing tools, and custom Excel add-ins."
    },
    "section2": {
      "title": "The Power of Excel Automation",
      "description": "VBA skills can save hundreds of hours by automating repetitive spreadsheet tasks.",
      "bulletPoints": [
        "Productivity Multiplier: Automate repetitive tasks",
        "Custom Solutions: Build tools beyond standard Excel",
        "Career Differentiator: Advanced skill valued by employers",
        "Integration: Connect Excel with other Office apps",
        "Legacy Systems: Many businesses rely on VBA solutions"
      ]
    },
    "section3": {
      "title": "VBA Career Opportunities",
      "description": "VBA skills enhance these analytical and technical roles:",
      "bulletPoints": [
        "Financial Modeler",
        "Business Intelligence Analyst",
        "Data Analyst",
        "Operations Analyst",
        "Excel Developer",
        "Process Automation Specialist",
        "Consultant",
        "Accountant (Advanced)",
        "ERP Analyst"
      ]
    }
  },
  "UI and UX": {
    "courseImage": "/CourseDetails/UIUX.jpg",
    "courseDescription": "Our UI/UX Design course provides comprehensive training in user-centered design principles and practices. You'll learn to create intuitive, visually appealing digital experiences through user research, wireframing, prototyping, and usability testing. The curriculum covers both theoretical foundations and practical skills using industry-standard tools.",
    "section1": {
      "title": "UI/UX Course Content",
      "description": "The course includes user research methods, information architecture, interaction design, visual design principles, prototyping with Figma/Adobe XD, usability testing, and accessibility standards. You'll complete portfolio projects demonstrating the complete design process from concept to high-fidelity prototypes."
    },
    "section2": {
      "title": "Why UI/UX Design Matters",
      "description": "Great design is crucial for product success in competitive digital markets.",
      "bulletPoints": [
        "User-Centric Approach: Design products people love to use",
        "Business Impact: Good UX increases conversion and retention",
        "High Demand: Growing need for design skills across industries",
        "Creative + Technical: Blend artistic and analytical skills",
        "Remote Opportunities: Many design jobs are location-independent"
      ]
    },
    "section3": {
      "title": "UI/UX Career Paths",
      "description": "Design skills lead to rewarding creative technology roles:",
      "bulletPoints": [
        "UI Designer",
        "UX Designer",
        "Interaction Designer",
        "Product Designer",
        "UX Researcher",
        "Information Architect",
        "UX Writer",
        "Design System Specialist",
        "Chief Design Officer"
      ]
    }
  },
  "Salesforce": {
    "courseImage": "/CourseDetails/Salesforce.jpg",
    "courseDescription": "Our Salesforce course provides complete training in the world's #1 CRM platform. You'll learn to configure, customize, and administer Salesforce solutions while preparing for Salesforce certification exams. The curriculum covers Sales Cloud, Service Cloud, administration, and development on the Salesforce platform.",
    "section1": {
      "title": "Salesforce Course Content",
      "description": "The syllabus includes data modeling, security configuration, process automation, reports/dashboards, Lightning components, and basic Apex programming. You'll work with real Salesforce orgs to implement business solutions, integrate with other systems, and optimize CRM workflows."
    },
    "section2": {
      "title": "The Salesforce Advantage",
      "description": "Salesforce skills offer exceptional career opportunities in the growing CRM market.",
      "bulletPoints": [
        "Market Leader: 20%+ share of global CRM market",
        "High Salaries: Certified professionals earn premium compensation",
        "Ecosystem Growth: 3.3 million Salesforce jobs by 2022",
        "Continuous Innovation: Regular platform updates with new features",
        "Community Support: Active Trailblazer community and resources"
      ]
    },
    "section3": {
      "title": "Salesforce Career Opportunities",
      "description": "Salesforce expertise leads to high-demand tech roles:",
      "bulletPoints": [
        "Salesforce Administrator",
        "Salesforce Developer",
        "Salesforce Consultant",
        "Business Analyst (Salesforce)",
        "CRM Manager",
        "Marketing Cloud Specialist",
        "Salesforce Architect",
        "Service Cloud Consultant",
        "Sales Operations Manager"
      ]
    }
  },

  "jQuery": {
    "courseImage": "/CourseDetails/jQuery.jpg",
    "courseDescription": "Our jQuery course provides comprehensive training in the world's most popular JavaScript library. You'll learn to simplify DOM manipulation, event handling, animations, and AJAX interactions to create dynamic, interactive web applications. This course is perfect for JavaScript developers looking to enhance their frontend development skills with this powerful library.",
    "section1": {
      "title": "jQuery Course Content",
      "description": "The curriculum covers jQuery syntax, selectors, DOM traversal and manipulation, event handling, effects and animations, AJAX implementation, form handling, and plugin usage. You'll learn to work with jQuery UI for interactive elements and optimize jQuery performance. The course includes practical projects to build real-world web applications."
    },
    "section2": {
      "title": "The jQuery Advantage",
      "description": "jQuery remains widely used despite modern JavaScript frameworks, offering unique benefits for web development.",
      "bulletPoints": [
        "Simplified JavaScript: Write less, do more with concise syntax",
        "Cross-Browser Compatibility: Handles browser inconsistencies automatically",
        "Rich Ecosystem: Thousands of plugins for extended functionality",
        "Quick Prototyping: Rapidly build interactive features",
        "Legacy Code Maintenance: Essential for maintaining older websites"
      ]
    },
    "section3": {
      "title": "jQuery Career Opportunities",
      "description": "jQuery skills are valuable for these web development roles:",
      "bulletPoints": [
        "Frontend Developer",
        "JavaScript Developer",
        "Web Application Developer",
        "UI Developer",
        "WordPress Developer",
        "Full Stack Developer",
        "Web Designer",
        "Technical Consultant",
        "Legacy System Maintainer"
      ]
    }
  },

  "HTML": {
    "courseImage": "/CourseDetails/HTML.jpg",
    "courseDescription": "Our HTML course provides comprehensive training in the foundational language of the web. You'll learn to structure web content semantically, create accessible websites, and understand how HTML works with CSS and JavaScript. The curriculum covers everything from basic tags to modern HTML5 features, preparing you for frontend web development.",
    "section1": {
      "title": "HTML Course Content",
      "description": "The syllabus includes HTML syntax, document structure, text formatting, links, images, tables, forms, and multimedia elements. You'll learn semantic HTML5 tags, accessibility best practices, SEO fundamentals, and how to validate your markup. The course also covers integration with CSS and basic DOM manipulation."
    },
    "section2": {
      "title": "Why Learn HTML?",
      "description": "HTML is the essential starting point for anyone interested in web development and design.",
      "bulletPoints": [
        "Web Foundation: The backbone of every website on the internet",
        "Beginner-Friendly: Easy to learn with immediate visible results",
        "Career Gateway: First step to becoming a web developer",
        "Universal Skill: Needed across all web-related disciplines",
        "Future-Proof: Continually evolving with new standards"
      ]
    },
    "section3": {
      "title": "HTML Career Applications",
      "description": "HTML skills are fundamental for these web-related roles:",
      "bulletPoints": [
        "Frontend Developer",
        "Web Designer",
        "UI/UX Designer",
        "Content Manager",
        "Email Developer",
        "SEO Specialist",
        "Technical Writer",
        "WordPress Developer",
        "Digital Marketing Specialist"
      ]
    }
  },

  
  "Informatica PowerCenter": {
    "courseImage": "/CourseDetails/InformaticaPowerCenter.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design Informatica PowerCenter content at ICLP. Our Informatica PowerCenter Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Informatica PowerCenter course details.",
    "section1": {
      "title": "Informatica PowerCenter Course Content",
      "description": "In-depth exploratory research is carried out by experts to design Informatica PowerCenter content at ICLP. Our Informatica PowerCenter Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Informatica PowerCenter course content."
    },
    "section2": {
      "title": "Build Your Future with Informatica PowerCenter",
      "description": "Master the core concepts of Informatica PowerCenter and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning Informatica PowerCenter",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "Informatica PowerCenter Specialist",
        "Informatica PowerCenter Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "Informatica ILM": {
    "courseImage": "/CourseDetails/InformaticaILM.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design Informatica ILM content at ICLP. Our Informatica ILM Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Informatica ILM course details.",
    "section1": {
      "title": "Informatica ILM Course Content",
      "description": "In-depth exploratory research is carried out by experts to design Informatica ILM content at ICLP. Our Informatica ILM Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Informatica ILM course content."
    },
    "section2": {
      "title": "Build Your Future with Informatica ILM",
      "description": "Master the core concepts of Informatica ILM and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning Informatica ILM",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "Informatica ILM Specialist",
        "Informatica ILM Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "SAS Course": {
    "courseImage": "/CourseDetails/SASCourse.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design SAS Course content at ICLP. Our SAS Course Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete SAS Course course details.",
    "section1": {
      "title": "SAS Course Course Content",
      "description": "In-depth exploratory research is carried out by experts to design SAS Course content at ICLP. Our SAS Course Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete SAS Course course content."
    },
    "section2": {
      "title": "Build Your Future with SAS Course",
      "description": "Master the core concepts of SAS Course and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning SAS Course",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "SAS Course Specialist",
        "SAS Course Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "CCNA Online Training": {
    "courseImage": "/CourseDetails/CCNAOnlineTraining.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design CCNA Online Training content at ICLP. Our CCNA Online Training Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete CCNA Online Training course details.",
    "section1": {
      "title": "CCNA Online Training Course Content",
      "description": "In-depth exploratory research is carried out by experts to design CCNA Online Training content at ICLP. Our CCNA Online Training Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete CCNA Online Training course content."
    },
    "section2": {
      "title": "Build Your Future with CCNA Online Training",
      "description": "Master the core concepts of CCNA Online Training and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning CCNA Online Training",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "CCNA Online Training Specialist",
        "CCNA Online Training Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "CCNP": {
    "courseImage": "/CourseDetails/CCNP.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design CCNP content at ICLP. Our CCNP Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete CCNP course details.",
    "section1": {
      "title": "CCNP Course Content",
      "description": "In-depth exploratory research is carried out by experts to design CCNP content at ICLP. Our CCNP Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete CCNP course content."
    },
    "section2": {
      "title": "Build Your Future with CCNP",
      "description": "Master the core concepts of CCNP and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning CCNP",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "CCNP Specialist",
        "CCNP Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "Fortinet Online": {
    "courseImage": "/CourseDetails/FortinetOnline.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design Fortinet Online content at ICLP. Our Fortinet Online Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Fortinet Online course details.",
    "section1": {
      "title": "Fortinet Online Course Content",
      "description": "In-depth exploratory research is carried out by experts to design Fortinet Online content at ICLP. Our Fortinet Online Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Fortinet Online course content."
    },
    "section2": {
      "title": "Build Your Future with Fortinet Online",
      "description": "Master the core concepts of Fortinet Online and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning Fortinet Online",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "Fortinet Online Specialist",
        "Fortinet Online Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "PL and SQL": {
    "courseImage": "/CourseDetails/PLandSQL.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design PL and SQL content at ICLP. Our PL and SQL Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete PL and SQL course details.",
    "section1": {
      "title": "PL and SQL Course Content",
      "description": "In-depth exploratory research is carried out by experts to design PL and SQL content at ICLP. Our PL and SQL Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete PL and SQL course content."
    },
    "section2": {
      "title": "Build Your Future with PL and SQL",
      "description": "Master the core concepts of PL and SQL and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning PL and SQL",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "PL and SQL Specialist",
        "PL and SQL Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "ChatGPT Online Course": {
    "courseImage": "/CourseDetails/ChatGPTOnlineCourse.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design ChatGPT Online Course content at ICLP. Our ChatGPT Online Course Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete ChatGPT Online Course course details.",
    "section1": {
      "title": "ChatGPT Online Course Course Content",
      "description": "In-depth exploratory research is carried out by experts to design ChatGPT Online Course content at ICLP. Our ChatGPT Online Course Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete ChatGPT Online Course course content."
    },
    "section2": {
      "title": "Build Your Future with ChatGPT Online Course",
      "description": "Master the core concepts of ChatGPT Online Course and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning ChatGPT Online Course",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "ChatGPT Online Course Specialist",
        "ChatGPT Online Course Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "Blockchain Online": {
    "courseImage": "/CourseDetails/BlockchainOnline.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design Blockchain Online content at ICLP. Our Blockchain Online Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Blockchain Online course details.",
    "section1": {
      "title": "Blockchain Online Course Content",
      "description": "In-depth exploratory research is carried out by experts to design Blockchain Online content at ICLP. Our Blockchain Online Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Blockchain Online course content."
    },
    "section2": {
      "title": "Build Your Future with Blockchain Online",
      "description": "Master the core concepts of Blockchain Online and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning Blockchain Online",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "Blockchain Online Specialist",
        "Blockchain Online Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "Certified Information Security Manager (CISM)": {
    "courseImage": "/CourseDetails/CertifiedInformationSecurityManagerCISM.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design Certified Information Security Manager (CISM) content at ICLP. Our Certified Information Security Manager (CISM) Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Certified Information Security Manager (CISM) course details.",
    "section1": {
      "title": "Certified Information Security Manager (CISM) Course Content",
      "description": "In-depth exploratory research is carried out by experts to design Certified Information Security Manager (CISM) content at ICLP. Our Certified Information Security Manager (CISM) Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Certified Information Security Manager (CISM) course content."
    },
    "section2": {
      "title": "Build Your Future with Certified Information Security Manager (CISM)",
      "description": "Master the core concepts of Certified Information Security Manager (CISM) and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning Certified Information Security Manager (CISM)",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "Certified Information Security Manager (CISM) Specialist",
        "Certified Information Security Manager (CISM) Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "Certified Information Systems Auditor (CISA)": {
    "courseImage": "/CourseDetails/CertifiedInformationSystemsAuditorCISA.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design Certified Information Systems Auditor (CISA) content at ICLP. Our Certified Information Systems Auditor (CISA) Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Certified Information Systems Auditor (CISA) course details.",
    "section1": {
      "title": "Certified Information Systems Auditor (CISA) Course Content",
      "description": "In-depth exploratory research is carried out by experts to design Certified Information Systems Auditor (CISA) content at ICLP. Our Certified Information Systems Auditor (CISA) Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Certified Information Systems Auditor (CISA) course content."
    },
    "section2": {
      "title": "Build Your Future with Certified Information Systems Auditor (CISA)",
      "description": "Master the core concepts of Certified Information Systems Auditor (CISA) and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning Certified Information Systems Auditor (CISA)",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "Certified Information Systems Auditor (CISA) Specialist",
        "Certified Information Systems Auditor (CISA) Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "CyberArk Training": {
    "courseImage": "/CourseDetails/CyberArkTraining.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design CyberArk Training content at ICLP. Our CyberArk Training Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete CyberArk Training course details.",
    "section1": {
      "title": "CyberArk Training Course Content",
      "description": "In-depth exploratory research is carried out by experts to design CyberArk Training content at ICLP. Our CyberArk Training Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete CyberArk Training course content."
    },
    "section2": {
      "title": "Build Your Future with CyberArk Training",
      "description": "Master the core concepts of CyberArk Training and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning CyberArk Training",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "CyberArk Training Specialist",
        "CyberArk Training Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "CISM Certification Online Training": {
    "courseImage": "/CourseDetails/CISMCertificationOnlineTraining.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design CISM Certification Online Training content at ICLP. Our CISM Certification Online Training Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete CISM Certification Online Training course details.",
    "section1": {
      "title": "CISM Certification Online Training Course Content",
      "description": "In-depth exploratory research is carried out by experts to design CISM Certification Online Training content at ICLP. Our CISM Certification Online Training Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete CISM Certification Online Training course content."
    },
    "section2": {
      "title": "Build Your Future with CISM Certification Online Training",
      "description": "Master the core concepts of CISM Certification Online Training and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning CISM Certification Online Training",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "CISM Certification Online Training Specialist",
        "CISM Certification Online Training Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "Cisco UCS": {
    "courseImage": "/CourseDetails/CiscoUCS.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design Cisco UCS content at ICLP. Our Cisco UCS Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Cisco UCS course details.",
    "section1": {
      "title": "Cisco UCS Course Content",
      "description": "In-depth exploratory research is carried out by experts to design Cisco UCS content at ICLP. Our Cisco UCS Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Cisco UCS course content."
    },
    "section2": {
      "title": "Build Your Future with Cisco UCS",
      "description": "Master the core concepts of Cisco UCS and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning Cisco UCS",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "Cisco UCS Specialist",
        "Cisco UCS Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "Groovy and Grails": {
    "courseImage": "/CourseDetails/GroovyandGrails.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design Groovy and Grails content at ICLP. Our Groovy and Grails Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Groovy and Grails course details.",
    "section1": {
      "title": "Groovy and Grails Course Content",
      "description": "In-depth exploratory research is carried out by experts to design Groovy and Grails content at ICLP. Our Groovy and Grails Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Groovy and Grails course content."
    },
    "section2": {
      "title": "Build Your Future with Groovy and Grails",
      "description": "Master the core concepts of Groovy and Grails and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning Groovy and Grails",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "Groovy and Grails Specialist",
        "Groovy and Grails Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "Full-Stack Java Training Course Online": {
    "courseImage": "/CourseDetails/FullStackJavaTrainingCourseOnline.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design Full-Stack Java Training Course Online content at ICLP. Our Full-Stack Java Training Course Online Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Full-Stack Java Training Course Online course details.",
    "section1": {
      "title": "Full-Stack Java Training Course Online Course Content",
      "description": "In-depth exploratory research is carried out by experts to design Full-Stack Java Training Course Online content at ICLP. Our Full-Stack Java Training Course Online Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Full-Stack Java Training Course Online course content."
    },
    "section2": {
      "title": "Build Your Future with Full-Stack Java Training Course Online",
      "description": "Master the core concepts of Full-Stack Java Training Course Online and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning Full-Stack Java Training Course Online",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "Full-Stack Java Training Course Online Specialist",
        "Full-Stack Java Training Course Online Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "Python Full Stack Developer Online": {
    "courseImage": "/CourseDetails/PythonFullStackDeveloperOnline.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design Python Full Stack Developer Online content at ICLP. Our Python Full Stack Developer Online Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Python Full Stack Developer Online course details.",
    "section1": {
      "title": "Python Full Stack Developer Online Course Content",
      "description": "In-depth exploratory research is carried out by experts to design Python Full Stack Developer Online content at ICLP. Our Python Full Stack Developer Online Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Python Full Stack Developer Online course content."
    },
    "section2": {
      "title": "Build Your Future with Python Full Stack Developer Online",
      "description": "Master the core concepts of Python Full Stack Developer Online and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning Python Full Stack Developer Online",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "Python Full Stack Developer Online Specialist",
        "Python Full Stack Developer Online Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },

  "SAP Quality Management (QM)": {
  "courseDescription": "This SAP QM training provides comprehensive knowledge of quality management processes integrated with procurement, production and inventory management in SAP systems. The course covers configuration, master data, inspections and reporting for manufacturing and service industries.",
  "section1": {
    "title": "SAP QM Course Content",
    "description": "The curriculum covers quality management processes from enterprise structure setup to production inspections and vendor evaluations. Includes hands-on exercises for inspection planning, quality certificates and integration with other SAP modules."
  },
  "section2": {
    "title": "Why Learn SAP QM?",
    "description": "Quality Management is critical for manufacturing, pharmaceutical and automotive industries with strict compliance requirements.",
    "bulletPoints": [
      "Quality Compliance: Essential for regulated industries",
      "Career Growth: High demand in manufacturing sectors",
      "Process Integration: Central to SAP PP-PI and MM modules",
      "Cost Reduction: Helps minimize quality-related losses",
      "Certification Value: SAP QM certification boosts career prospects"
    ]
  },
  "section3": {
    "title": "Career Paths with SAP QM",
    "description": "Skills in Quality Management can lead to roles such as:",
    "bulletPoints": [
      "SAP QM Consultant",
      "Quality Process Analyst",
      "Manufacturing Quality Systems Specialist",
      "Pharmaceutical Compliance Manager",
      "Automotive Quality Engineer",
      "QM Module Support Specialist"
    ]
  }
},

  "SAP Security GRC Training": {
    "courseImage": "/CourseDetails/sap-grc-course.jpg",
    "courseDescription": "This SAP GRC training provides comprehensive skills in access governance and risk management through hands-on exercises with real compliance scenarios. Learn from certified GRC professionals with audit experience.",
    "section1": {
      "title": "SAP GRC Course Content",
      "description": "Our curriculum covers all GRC Access Control modules from SoD analysis to emergency access management, using real-world case studies and compliance frameworks."
    },
    "section2": {
      "title": "Why SAP GRC Skills Are Critical",
      "description": "Regulatory compliance and access governance are top priorities for enterprises.",
      "bulletPoints": [
        "High Demand: GRC professionals earn 25-40% premium over base SAP security roles",
        "Practical Focus: Configure real SoD rules and firefighter workflows",
        "Certification Path: Aligns with SAP GRC 12.0 certification",
        "Career Security: Compliance roles are recession-resilient",
        "Future-Proof: Skills applicable to both ECC and S/4HANA environments"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP GRC Consultant",
        "Access Control Specialist",
        "IT Compliance Analyst",
        "Security Risk Manager",
        "SoD Auditor",
        "User Provisioning Architect",
        "Identity Governance Lead",
        "Chief Information Security Officer (CISO) track"
      ]
    }
  },

  "SAP Analytics Cloud Online Training": {
    "courseImage": "/CourseDetails/sac-course.jpg",
    "courseDescription": "This SAP Analytics Cloud training provides comprehensive skills in cloud-based analytics, planning, and predictive capabilities through hands-on exercises with real business scenarios.",
    "section1": {
      "title": "SAP Analytics Cloud Course Content",
      "description": "Covering all SAC modules from data modeling to augmented analytics, our curriculum is designed by certified SAC consultants with actual implementation experience."
    },
    "section2": {
      "title": "Why Learn SAP Analytics Cloud?",
      "description": "Cloud analytics is transforming how enterprises leverage data for decision-making.",
      "bulletPoints": [
        "Strategic Skill: SAC is SAP's flagship analytics platform",
        "High Demand: 80% of SAP customers adopting SAC (IDC 2023)",
        "Practical Learning: Build real dashboards and planning models",
        "Certification Path: Prepares for SAP Certified Application Associate - SAC",
        "Future-Proof: Combines BI, planning and AI capabilities"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAC Consultant",
        "Cloud Analytics Specialist",
        "Enterprise BI Developer",
        "Planning & Forecasting Analyst",
        "Predictive Analytics Designer",
        "Digital Boardroom Architect",
        "Analytics Solution Manager",
        "Data Visualization Expert"
      ]
    }
  },

  "SAP BI/BW Training": {
    "courseImage": "/CourseDetails/sap-bi-bw-course.jpg",
    "courseDescription": "Master SAP's enterprise data warehousing and analytics platform with hands-on training in BW modeling, HANA optimization, and business intelligence reporting. Gain real-world implementation skills from certified SAP BI consultants.",
    "section1": {
      "title": "SAP BI/BW Course Content",
      "description": "Our curriculum covers traditional BW modeling, HANA-optimized objects, and modern analytics tools - providing end-to-end data warehouse implementation skills."
    },
    "section2": {
      "title": "Why SAP BI/BW Skills Are Valuable",
      "description": "Data-driven decision making requires robust enterprise data platforms.",
      "bulletPoints": [
        "High Demand: BW professionals average 20% higher salaries than generic BI roles",
        "Future-Proof: BW/4HANA is SAP's strategic data warehouse",
        "Practical Focus: Build real cubes and DSOs in class",
        "Certification Path: Prepares for SAP Certified Application Associate - BW/4HANA",
        "Hybrid Skills: Combines data engineering and analytics"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP BW Consultant",
        "Data Warehouse Architect",
        "ETL Developer",
        "BI Reporting Specialist",
        "BW/HANA Modeler",
        "Analytics Solution Manager",
        "Enterprise Data Analyst",
        "BI Project Lead"
      ]
    }
  },

  "SAP IBP Online Training": {
    "courseImage": "/CourseDetails/sap-ibp-course.jpg",
    "courseDescription": "This SAP IBP online training provides end-to-end knowledge of cloud-based supply chain planning with hands-on exercises in demand sensing, inventory optimization, and integrated business planning using real HANA-powered scenarios.",
    "section1": {
      "title": "SAP IBP Course Content",
      "description": "Covering all IBP modules from core configuration to advanced forecasting, our curriculum is designed by SAP-certified IBP consultants with actual implementation experience across industries."
    },
    "section2": {
      "title": "Why SAP IBP Skills Are Valuable",
      "description": "Cloud-based supply chain planning is transforming enterprise operations.",
      "bulletPoints": [
        "Future-Proof: SAP's strategic SCP solution",
        "High Demand: 65% of SAP customers planning IBP adoption (Gartner)",
        "Practical Learning: Configure real planning scenarios",
        "Certification Path: Prepares for SAP IBP certification",
        "Hybrid Skills: Combines supply chain and cloud expertise"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP IBP Consultant",
        "Demand Planning Manager",
        "Supply Chain Analyst",
        "S&OP Process Specialist",
        "IBP Configuration Expert",
        "Inventory Optimization Lead",
        "SCM Cloud Architect",
        "Integrated Business Planner"
      ]
    }
  },

  "SAP APO Online Training": {
    "courseImage": "/CourseDetails/sap-apo-course.jpg",
    "courseDescription": "This SAP APO online training provides comprehensive knowledge of supply chain planning tools with hands-on exercises in demand forecasting, network optimization, and production scheduling using real-world scenarios.",
    "section1": {
      "title": "SAP APO Course Content",
      "description": "Covering all core APO modules from Demand Planning to PP/DS, our curriculum is designed by SCM consultants with 15+ years of implementation experience across industries."
    },
    "section2": {
      "title": "Why SAP APO Skills Are Valuable",
      "description": "Supply chain optimization is a top priority for enterprises facing global disruptions.",
      "bulletPoints": [
        "High Demand: APO skills command 20-30% premium over base SAP salaries",
        "Practical Focus: Work with real planning books and optimization profiles",
        "Integration Expertise: Master CIF for ECC-APO data flows",
        "Career Growth: Path to SCM architect or planning manager roles",
        "Future-Ready: Foundation for transitioning to SAP IBP"
      ]
    },
    "section3": {
      "title": "Career Paths After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP APO Consultant",
        "Demand Planning Analyst",
        "Supply Chain Optimization Specialist",
        "PP/DS Scheduler",
        "GATP Configuration Expert",
        "SCM Solution Architect",
        "Inventory Optimization Manager",
        "CIF Integration Specialist"
      ]
    }
  },

  "SAP SRM Training": {
    "courseImage": "/CourseDetails/sap-srm-course.jpg",
    "courseDescription": "Master SAP Supplier Relationship Management with hands-on training in procurement processes, technical configurations, and supplier collaboration tools. Learn from certified SAP SRM consultants with real implementation experience.",
    "section1": {
      "title": "SAP SRM Course Content",
      "description": "Our curriculum covers all critical SRM modules from basic procurement scenarios to advanced sourcing techniques, using real-world case studies and practical exercises."
    },
    "section2": {
      "title": "Why Learn SAP SRM?",
      "description": "Procurement transformation is a top priority for enterprises looking to optimize supply chains and reduce costs.",
      "bulletPoints": [
        "High-Value Skills: SRM professionals command premium salaries",
        "Practical Focus: Configure real procurement scenarios in class",
        "Integration Expertise: Learn MM-FI-SRM data flows",
        "Career Flexibility: Roles in functional or technical tracks",
        "Future-Ready: Foundation for transitioning to SAP Ariba"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP SRM Functional Consultant",
        "Procurement Process Specialist",
        "SRM Technical Developer",
        "Supplier Portal Administrator",
        "Sourcing Analyst",
        "SRM Workflow Consultant",
        "Procurement Systems Manager",
        "SRM-Ariba Integration Specialist"
      ]
    }
  },
  
  "SAP IS Utilities Training": {
    "courseImage": "/CourseDetails/sap-is-utilities-course.jpg",
    "courseDescription": "Specialized SAP training for utility professionals covering customer lifecycle management, meter-to-cash processes, and regulatory compliance. Learn from certified IS-U consultants with industry experience.",
    "section1": {
      "title": "SAP IS Utilities Course Content",
      "description": "Our curriculum covers all utility modules from market structures to financial accounting, using real-world utility scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP IS Utilities Skills Matter",
      "description": "Utility digital transformation requires specialized SAP knowledge.",
      "bulletPoints": [
        "Industry-Specific: Focused on utility operations",
        "High Demand: 40% growth in utility SAP roles (2023)",
        "Regulatory Ready: Compliance-focused training",
        "Certification Path: Prepares for SAP Utilities certification",
        "Future-Proof: S/4HANA Utilities compatible"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP Utilities Consultant",
        "Billing System Analyst",
        "Meter Data Manager",
        "Customer Information Specialist",
        "Regulatory Compliance Analyst",
        "Utility Financial Accountant",
        "Field Service Systems Lead",
        "AMI Implementation Manager"
      ]
    }
  },
  
  "SAP IS Retail Training": {
    "courseImage": "/CourseDetails/sap-is-retail-course.jpg",
    "courseDescription": "Master SAP's retail-specific solutions with hands-on training in merchandise planning, store operations, and omnichannel integration. Learn from certified SAP Retail consultants with industry experience.",
    "section1": {
      "title": "SAP IS Retail Course Content",
      "description": "Our curriculum covers all retail modules from basic navigation to advanced merchandise distribution, using real-world retail scenarios and hands-on exercises."
    },
    "section2": {
      "title": "Why SAP IS Retail Skills Are Valuable",
      "description": "Retail digital transformation requires specialized SAP knowledge.",
      "bulletPoints": [
        "Industry-Specific: Focused on retail operations",
        "High Demand: 45% growth in retail SAP roles (2023)",
        "Omnichannel Ready: Skills for physical/digital retail",
        "Certification Path: Prepares for SAP Retail certification",
        "Future-Proof: S/4HANA Retail compatible"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP Retail Consultant",
        "Merchandise Planner",
        "Store Systems Manager",
        "Retail Data Analyst",
        "Omnichannel Operations Specialist",
        "Inventory Replenishment Analyst",
        "Retail Pricing Manager",
        "POS Implementation Lead"
      ]
    }
  },

  
  "SAP FSCM (Retail) Training": {
    "courseImage": "/CourseDetails/sap-fscm-retail-course.jpg",
    "courseDescription": "Specialized SAP FSCM training for retail professionals covering financial processes integrated with merchandise planning, store operations, and vendor management. Learn retail-specific configurations from industry experts.",
    "section1": {
      "title": "SAP FSCM Retail Course Content",
      "description": "Our curriculum covers retail financial processes from merchandise master data to POS integration, using real-world retail case studies and hands-on exercises."
    },
    "section2": {
      "title": "Why Retail-Focused FSCM Skills Matter",
      "description": "Retail financial operations require specialized SAP knowledge beyond standard FSCM.",
      "bulletPoints": [
        "Industry-Specific: Focused on retail financial processes",
        "High Demand: Retail SAP consultants earn 30% premium",
        "Practical Scenarios: Work with real retail data models",
        "Omnichannel Ready: Skills applicable to physical and digital retail",
        "Career Growth: Path to retail finance or merchandise planning roles"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "Retail FSCM Consultant",
        "Merchandise Financial Analyst",
        "Retail Systems Accountant",
        "Store Operations Manager",
        "Vendor Management Specialist",
        "Retail Pricing Analyst",
        "Omnichannel Finance Lead",
        "Retail IT Project Manager"
      ]
    }
  },

  "SAP CRM Training": {
    "courseImage": "/CourseDetails/sap-crm-course.jpg",
    "courseDescription": "This SAP CRM training in Chennai provides end-to-end knowledge of customer relationship management processes with hands-on practice in Web UI, marketing campaigns, sales pipelines, and service management.",
    "section1": {
      "title": "SAP CRM Course Content",
      "description": "Covering all modules from architecture fundamentals to advanced middleware integration, our curriculum is designed by SAP CRM consultants with 10+ years of implementation experience."
    },
    "section2": {
      "title": "Why SAP CRM Skills Are Valuable",
      "description": "CRM specialists bridge business needs with technical solutions in customer-facing processes.",
      "bulletPoints": [
        "High Demand: CRM implementations continue across industries",
        "Practical Training: Real-world scenarios using SAP IDES system",
        "Comprehensive Coverage: From Web UI to backend middleware",
        "Career Flexibility: Roles in functional, technical, or hybrid profiles",
        "Upgrade-Ready: Foundation for transitioning to SAP C4C"
      ]
    },
    "section3": {
      "title": "Career Paths After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP CRM Functional Consultant",
        "CRM Technical Developer",
        "Customer Experience Manager",
        "Sales Force Automation Specialist",
        "Service Management Consultant",
        "CRM Middleware Administrator",
        "Marketing Automation Analyst",
        "CRM Project Manager"
      ]
    }
  },

  "SAP Business Technology Platform (BTP)": {
    "courseImage": "/CourseDetails/sap-btp-course.jpg",
    "courseDescription": "This comprehensive SAP BTP training equips you with skills to develop, extend, and integrate applications on SAP's next-generation cloud platform. Through hands-on labs and real-world scenarios, learn to leverage BTP services for digital transformation initiatives.",
    "section1": {
      "title": "SAP BTP Course Content",
      "description": "Our curriculum covers the full spectrum of BTP capabilities - from application development with CAP to advanced integration scenarios and AI services. The course includes 60% hands-on exercises using live SAP BTP environments."
    },
    "section2": {
      "title": "Why SAP BTP Skills Matter",
      "description": "As enterprises accelerate cloud adoption, SAP BTP professionals are critical for building the digital core of intelligent enterprises.",
      "bulletPoints": [
        "Future-Proof Skills: Learn the platform underpinning SAP's cloud strategy",
        "High Demand: 72% of SAP customers plan BTP implementations (SAP Insights 2023)",
        "Versatile Applications: Skills applicable across industries",
        "Certification Path: Prepares for SAP Certified Development Associate - SAP BTP",
        "Hybrid Expertise: Bridge between on-prem and cloud landscapes"
      ]
    },
    "section3": {
      "title": "Career Paths with SAP BTP",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP BTP Developer",
        "Cloud Integration Architect",
        "SAP Extension Specialist",
        "SAP Technical Consultant (BTP)",
        "Enterprise Application Developer",
        "SAP Cloud Solutions Architect",
        "SAP AI/ML Engineer",
        "SAP UX Developer"
      ]
    }
  },

  "SAP FSCM": {
    "courseImage": "/CourseDetails/sap-fscm-training.jpg",
    "courseDescription": "Master SAP Financial Supply Chain Management (FSCM) with hands-on training in Chennai. This course covers retail processes, master data setup, pricing, procurement, and store operations, preparing you for real-world SAP FSCM implementations.",
    "section1": {
      "title": "SAP FSCM Course Content",
      "description": "Our industry-designed curriculum covers all critical aspects of SAP FSCM with special focus on retail processes. Learn from certified SAP practitioners with real implementation experience."
    },
    "section2": {
      "title": "Why Learn SAP FSCM?",
      "description": "SAP FSCM professionals are in high demand across retail, manufacturing, and logistics sectors. Gain skills that make you valuable to organizations implementing SAP solutions.",
      "bulletPoints": [
        "Industry-Ready Skills: Practical training on live SAP systems",
        "Retail Focus: Specialized content for merchandise and supply chain management",
        "Certification Preparation: Covers topics for SAP FSCM certification",
        "Hands-On Projects: Work on real-world retail scenarios",
        "Placement Support: Connect with SAP partner companies"
      ]
    },
    "section3": {
      "title": "Career Opportunities After SAP FSCM Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP FSCM Consultant",
        "Retail Process Analyst",
        "Credit & Collections Manager",
        "Merchandise Planner",
        "SAP FICO-FSCM Specialist",
        "Supply Chain Finance Analyst",
        "SAP Treasury Consultant",
        "Retail Solutions Architect"
      ]
    }
  },


  "C and C++": {
    "courseImage": "/CourseDetails/cpp.jpg",
    "courseDescription": "Our comprehensive C and C++ course provides a complete journey from procedural programming to object-oriented concepts. Designed by industry experts, this course covers everything from basic syntax to advanced memory management techniques, preparing you for real-world software development challenges.",
    "section1": {
      "title": "C and C++ Course Content",
      "description": "This meticulously designed curriculum takes you from the fundamentals of C programming to advanced C++ concepts. The course combines theoretical knowledge with practical implementation, ensuring you gain hands-on experience with these powerful programming languages."
    },
    "section2": {
      "title": "Build Your Programming Foundation",
      "description": "Mastering C and C++ opens doors to system programming, game development, and high-performance computing. These skills are valued across industries and form the basis for understanding modern computing systems.",
      "bulletPoints": [
        "Core Programming Concepts: Learn fundamentals that apply to all programming languages",
        "System-Level Understanding: Gain insight into how computers actually work",
        "Performance Optimization: Write efficient, high-speed code",
        "Versatile Applications: Skills applicable from embedded systems to game development",
        "Career Longevity: C/C++ skills remain relevant for decades"
      ]
    },
    "section3": {
      "title": "Career Opportunities with C/C++ Skills",
      "description": "Graduates of this course can pursue roles such as:",
      "bulletPoints": [
        "Systems Programmer",
        "Game Developer",
        "Embedded Systems Engineer",
        "C/C++ Developer",
        "Quantitative Developer",
        "Operating System Developer",
        "Compiler Engineer",
        "High-Frequency Trading Developer",
        "IoT Developer",
        "Performance Engineer"
      ]
    }
  },
  "TypeScript": {
    "courseImage": "/CourseDetails/TypeScript.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design TypeScript content at ICLP. Our TypeScript Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete TypeScript course details.",
    "section1": {
      "title": "TypeScript Course Content",
      "description": "In-depth exploratory research is carried out by experts to design TypeScript content at ICLP. Our TypeScript Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete TypeScript course content."
    },
    "section2": {
      "title": "Build Your Future with TypeScript",
      "description": "Master the core concepts of TypeScript and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning TypeScript",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "TypeScript Specialist",
        "TypeScript Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    }
  },
  "Perl Scripting": {
    "courseImage": "/CourseDetails/PerlScripting.jpg",
    "courseDescription": "In-depth exploratory research is carried out by experts to design Perl Scripting content at ICLP. Our Perl Scripting Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Perl Scripting course details.",
    "section1": {
      "title": "Perl Scripting Course Content",
      "description": "In-depth exploratory research is carried out by experts to design Perl Scripting content at ICLP. Our Perl Scripting Syllabus is developed by expert-level professionals to ensure the best anytime-anywhere training environment. This course will help you gain valuable knowledge and become a skilled expert in the domain. Below you will find the complete Perl Scripting course content."
    },
    "section2": {
      "title": "Build Your Future with Perl Scripting",
      "description": "Master the core concepts of Perl Scripting and step into a high-paying tech career. Whether you're a student, job seeker, or working professional, this training will help you stay ahead in the tech industry.",
      "bulletPoints": [
        "Beginner-Friendly: Designed to help newcomers quickly grasp essential concepts",
        "Industry-Relevant Skills: Covers practical applications used in real-world scenarios",
        "High Demand Across Industries: Equip yourself with skills valued by employers globally",
        "Strong Community & Resources: Supported by active forums, guides, and tools",
        "Future-Proof: Keeps you relevant in today's evolving technology landscape"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Learning Perl Scripting",
      "description": "Start your career in roles such as:",
      "bulletPoints": [
        "Perl Scripting Specialist",
        "Perl Scripting Consultant",
        "Software Engineer",
        "System Analyst",
        "Data Engineer",
        "IT Administrator",
        "Technical Support Engineer",
        "Developer",
        "Technology Consultant"
      ]
    },
    "SAP Transportation Management": {
      "courseDescription": "Our comprehensive SAP Transportation Management course provides in-depth training in one of SAP's most powerful logistics modules. The course covers everything from fundamental ERP concepts to advanced transportation management techniques, including ABAP programming for customization and integration with other SAP modules.",
  "section1": {
    "title": "SAP Transportation Management Course Content",
    "description": "The curriculum is designed to take you from basic ERP concepts to advanced SAP Transportation Management implementation. You'll learn ABAP programming, data dictionary, reporting techniques, and integration methods essential for transportation and logistics management in SAP environments."
  },
  "section2": {
    "title": "Why Learn SAP Transportation Management?",
    "description": "SAP TM is a critical module for logistics and supply chain management, used by major corporations worldwide to optimize their transportation operations and reduce costs.",
    "bulletPoints": [
      "High Demand: SAP TM professionals are in high demand globally",
      "Career Growth: Excellent opportunities for career advancement",
      "Industry Standard: SAP is the leading ERP in logistics and transportation",
      "Comprehensive Solution: Covers all aspects of transportation management",
      "Integration Capabilities: Seamless integration with other SAP modules"
    ]
  },
  "section3": {
    "title": "Career Paths with SAP Transportation Management",
    "description": "SAP TM skills can lead to various rewarding career opportunities including:",
    "bulletPoints": [
      "SAP TM Consultant",
      "Logistics Process Analyst",
      "Supply Chain Manager",
      "SAP ABAP Developer for Logistics",
      "SAP Integration Specialist",
      "Transportation Management System Architect",
      "SAP Project Manager for Logistics"
    ]
  }
    }
  },
  
  "SAP IS Insurance Training": {
    "courseImage": "/CourseDetails/sap-is-insurance-course.jpg",
    "courseDescription": "Specialized SAP training for insurance professionals covering policy lifecycle, claims processing, and regulatory compliance. Learn from certified IS-Insurance consultants with industry experience.",
    "section1": {
      "title": "SAP IS Insurance Course Content",
      "description": "Our curriculum covers all insurance modules from collections to claims management, using real-world insurance scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP IS Insurance Skills Matter",
      "description": "Insurance digital transformation requires specialized SAP knowledge.",
      "bulletPoints": [
        "Industry-Specific: Focused on insurance operations",
        "High Demand: 35% growth in insurance SAP roles (2023)",
        "Regulatory Ready: Compliance-focused training",
        "Certification Path: Prepares for SAP Insurance certification",
        "Future-Proof: S/4HANA Insurance compatible"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP Insurance Consultant",
        "Claims System Analyst",
        "Policy Administration Specialist",
        "Commission Calculation Manager",
        "Regulatory Compliance Analyst",
        "Insurance Financial Accountant",
        "Underwriting Systems Lead",
        "Fraud Detection Manager"
      ]
    }
  },
  
  "SAP PLM Training": {
    "courseImage": "/CourseDetails/sap-plm-course.jpg",
    "courseDescription": "Specialized SAP training for product development professionals covering engineering changes, compliance and manufacturing integration. Learn from certified PLM consultants with industry experience.",
    "section1": {
      "title": "SAP PLM Course Content",
      "description": "Our curriculum covers all PLM modules from document management to recipe development, using real-world product scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP PLM Skills Matter",
      "description": "Product innovation requires specialized SAP knowledge.",
      "bulletPoints": [
        "Industry-Specific: Focused on product development",
        "High Demand: 45% growth in PLM roles (2023)",
        "Compliance Ready: Regulatory-focused training",
        "Certification Path: Prepares for SAP PLM certification",
        "Future-Proof: S/4HANA PLM compatible"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP PLM Consultant",
        "Product Data Manager",
        "Engineering Change Specialist",
        "Compliance Analyst",
        "Manufacturing Systems Lead",
        "Quality Management Analyst",
        "Recipe Development Manager",
        "Innovation Process Lead"
      ]
    }
  },
  
  "SAP LE Certification Training": {
    "courseImage": "/CourseDetails/sap-le-course.jpg",
    "courseDescription": "Professional training for legal operations specialists covering entity management, compliance monitoring and legal workflow automation. Learn from certified LE consultants with industry experience.",
    "section1": {
      "title": "SAP LE Course Content",
      "description": "Our curriculum covers all legal entity modules from core concepts to advanced automation, using real-world compliance scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP LE Skills Matter",
      "description": "Corporate legal transformation requires specialized SAP knowledge.",
      "bulletPoints": [
        "Industry-Specific: Focused on legal operations",
        "High Demand: 50% growth in legal tech roles (2023)",
        "Compliance Ready: Regulation-focused training",
        "Certification Path: Prepares for SAP LE certification",
        "Future-Proof: Integrated with GRC solutions"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP Legal Consultant",
        "Compliance Systems Analyst",
        "Entity Management Specialist",
        "Legal Workflow Manager",
        "Regulatory Reporting Analyst",
        "Corporate Governance Lead",
        "Legal Tech Implementation Manager",
        "Risk Management Specialist"
      ]
    }
  },
  
  "SAP Healthcare Training": {
    "courseImage": "/CourseDetails/sap-healthcare-course.jpg",
    "courseDescription": "Specialized SAP training for healthcare professionals covering patient management, clinical processes and medical billing. Learn from certified Healthcare consultants with industry experience.",
    "section1": {
      "title": "SAP Healthcare Course Content",
      "description": "Our curriculum covers all healthcare modules from patient administration to invoicing, using real-world clinical scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP Healthcare Skills Matter",
      "description": "Healthcare digital transformation requires specialized SAP knowledge.",
      "bulletPoints": [
        "Industry-Specific: Focused on healthcare operations",
        "High Demand: 60% growth in healthcare IT roles (2023)",
        "Regulatory Ready: HIPAA-compliant training",
        "Certification Path: Prepares for SAP Healthcare certification",
        "Future-Proof: S/4HANA Healthcare compatible"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP Healthcare Consultant",
        "Clinical Systems Analyst",
        "Patient Data Specialist",
        "Medical Billing Manager",
        "Healthcare Compliance Analyst",
        "Revenue Cycle Lead",
        "Telehealth Systems Manager",
        "Clinical Documentation Specialist"
      ]
    }
  },
  
  "SAP IS Banking Training": {
    "courseImage": "/CourseDetails/sap-is-banking-course.jpg",
    "courseDescription": "Specialized SAP training for banking professionals covering loans, payments and financial product management. Learn from certified IS-Banking consultants with industry experience.",
    "section1": {
      "title": "SAP IS Banking Course Content",
      "description": "Our curriculum covers all banking modules from loans to integration, using real-world financial scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP IS Banking Skills Matter",
      "description": "Banking digital transformation requires specialized SAP knowledge.",
      "bulletPoints": [
        "Industry-Specific: Focused on banking operations",
        "High Demand: 55% growth in fintech SAP roles (2023)",
        "Regulatory Ready: Compliance-focused training",
        "Certification Path: Prepares for SAP Banking certification",
        "Future-Proof: S/4HANA Banking compatible"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP Banking Consultant",
        "Loan System Analyst",
        "Payment Processing Specialist",
        "Financial Product Manager",
        "Regulatory Compliance Analyst",
        "Core Banking Lead",
        "Fintech Implementation Manager",
        "Risk Management Specialist"
      ]
    }
  },
  
  "SAP BPC Online Training": {
    "courseImage": "/CourseDetails/sap-bpc-course.jpg",
    "courseDescription": "Professional training for finance specialists covering planning, consolidation and financial reporting. Learn from certified BPC consultants with industry experience.",
    "section1": {
      "title": "SAP BPC Course Content",
      "description": "Our curriculum covers all BPC modules from administration to consolidation, using real-world financial scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP BPC Skills Matter",
      "description": "Financial transformation requires specialized planning knowledge.",
      "bulletPoints": [
        "Industry-Standard: Used by Fortune 500 companies",
        "High Demand: 40% growth in FP&A roles (2023)",
        "Reporting Ready: Compliance-focused training",
        "Certification Path: Prepares for SAP BPC certification",
        "Future-Proof: Integrated with SAP Analytics Cloud"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP BPC Consultant",
        "Financial Planning Analyst",
        "Consolidation Specialist",
        "Corporate Reporting Manager",
        "FP&A Systems Lead",
        "Budgeting Process Manager",
        "Forecasting Analyst",
        "Financial Data Architect"
      ]
    }
  },
  
  "SAP PM Course": {
    "courseImage": "/CourseDetails/sap-pm-course.jpg",
    "courseDescription": "Specialized SAP training for maintenance professionals covering asset management, work orders and plant integration. Learn from certified PM consultants with industry experience.",
    "section1": {
      "title": "SAP PM Course Content",
      "description": "Our curriculum covers all plant maintenance modules from breakdown to planned maintenance, using real-world industrial scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP PM Skills Matter",
      "description": "Industrial digital transformation requires specialized maintenance knowledge.",
      "bulletPoints": [
        "Industry-Specific: Focused on plant operations",
        "High Demand: 50% growth in industrial IoT roles (2023)",
        "Reliability Ready: Uptime-focused training",
        "Certification Path: Prepares for SAP PM certification",
        "Future-Proof: S/4HANA Asset Management compatible"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP PM Consultant",
        "Maintenance Planner",
        "Reliability Engineer",
        "Asset Management Specialist",
        "Industrial IoT Analyst",
        "Plant Systems Lead",
        "Predictive Maintenance Manager",
        "Spare Parts Optimization Specialist"
      ]
    }
  },
  
  "SAP MDM Online Training": {
    "courseImage": "/CourseDetails/sap-mdm-course.jpg",
    "courseDescription": "Professional training for data management specialists covering master data governance, quality and syndication. Learn from certified MDM consultants with industry experience.",
    "section1": {
      "title": "SAP MDM Course Content",
      "description": "Our curriculum covers all MDM modules from data modeling to syndication, using real-world governance scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP MDM Skills Matter",
      "description": "Data governance transformation requires specialized MDM knowledge.",
      "bulletPoints": [
        "Enterprise-Critical: Single source of truth",
        "High Demand: 65% growth in data governance roles (2023)",
        "Quality Ready: Data-focused training",
        "Certification Path: Prepares for SAP MDM certification",
        "Future-Proof: Integrated with SAP Information Steward"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP MDM Consultant",
        "Master Data Manager",
        "Data Governance Specialist",
        "Data Quality Analyst",
        "Enterprise Architect",
        "CDO Office Lead",
        "Metadata Management Specialist",
        "Data Integration Manager"
      ]
    }
  },
  
  "SAP ESS Online": {
    "courseImage": "/CourseDetails/sap-ess-course.jpg",
    "courseDescription": "Professional training in SAP Employee Self-Service covering portal navigation, personal data management, and HR workflows for employees and managers.",
    "section1": {
      "title": "SAP ESS Course Content",
      "description": "Our curriculum covers all ESS modules from personal data to travel management, using real-world HR scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP ESS Skills Matter",
      "description": "HR digital transformation requires specialized self-service knowledge.",
      "bulletPoints": [
        "Employee-Centric: Focused on user experience",
        "High Demand: 40% growth in HR tech roles (2023)",
        "Process Efficiency: Reduces HR administrative workload",
        "Mobile Ready: Fiori app compatibility",
        "Future-Proof: Integrated with SAP SuccessFactors"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP HR Consultant",
        "ESS Support Specialist",
        "HR Process Analyst",
        "Employee Portal Manager",
        "HRIS Analyst",
        "Digital HR Lead",
        "Workforce Technology Specialist",
        "HR Service Delivery Manager"
      ]
    }
  },
  
  "SAP Hybris E-Commerce Online Training": {
    "courseImage": "/CourseDetails/sap-hybris-ecommerce-course.jpg",
    "courseDescription": "Specialized training in SAP Hybris Commerce covering storefront development, product management, and customer experience for digital commerce professionals.",
    "section1": {
      "title": "SAP Hybris Course Content",
      "description": "Our curriculum covers all commerce modules from setup to marketing, using real-world retail scenarios and hands-on development."
    },
    "section2": {
      "title": "Why SAP Hybris Skills Matter",
      "description": "Digital commerce transformation requires specialized platform knowledge.",
      "bulletPoints": [
        "Industry-Leading: Powering Fortune 500 e-commerce",
        "High Demand: 60% growth in commerce tech roles (2023)",
        "Omnichannel: Unified commerce capabilities",
        "Certification Path: Prepares for SAP Commerce certification",
        "Future-Proof: Part of SAP C/4HANA suite"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP Hybris Consultant",
        "E-Commerce Developer",
        "Product Information Manager",
        "Digital Experience Architect",
        "Commerce Solution Analyst",
        "Omnichannel Lead",
        "Customer Experience Manager",
        "Commerce Tech Lead"
      ]
    }
  },
  
  "SAP BO": {
    "courseImage": "/CourseDetails/sap-bo-course.jpg",
    "courseDescription": "Professional training in SAP BusinessObjects covering reporting, analytics, and dashboard development for business intelligence professionals.",
    "section1": {
      "title": "SAP BO Course Content",
      "description": "Our curriculum covers all BI modules from universe design to administration, using real-world analytics scenarios and hands-on development."
    },
    "section2": {
      "title": "Why SAP BO Skills Matter",
      "description": "Data-driven decision making requires specialized BI knowledge.",
      "bulletPoints": [
        "Enterprise Standard: Used by 80% of Fortune 500",
        "High Demand: 50% growth in BI roles (2023)",
        "Comprehensive: Full BI platform coverage",
        "Certification Path: Prepares for SAP BO certification",
        "Future-Proof: Integrated with SAP Analytics Cloud"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP BO Consultant",
        "BI Developer",
        "Reporting Analyst",
        "Data Visualization Specialist",
        "BI Administrator",
        "Enterprise Reporting Lead",
        "Analytics Solution Architect",
        "Business Intelligence Manager"
      ]
    }
  },
  
  "SAP BOBJ Training": {
    "courseImage": "/CourseDetails/sap-bobj-course.jpg",
    "courseDescription": "Advanced training in SAP BusinessObjects BI platform covering data modeling, advanced reporting, and enterprise analytics for BI professionals.",
    "section1": {
      "title": "SAP BOBJ Course Content",
      "description": "Our curriculum covers advanced BI techniques from OLAP to security, using real-world enterprise scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP BOBJ Skills Matter",
      "description": "Enterprise analytics requires specialized platform expertise.",
      "bulletPoints": [
        "Enterprise-Grade: Scalable BI platform",
        "High Demand: 55% growth in advanced BI roles (2023)",
        "Comprehensive: Covers entire BI lifecycle",
        "Certification Path: Prepares for SAP BOBJ certification",
        "Future-Proof: Bridges to SAP Analytics Cloud"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP BOBJ Architect",
        "Senior BI Developer",
        "OLAP Specialist",
        "Enterprise Reporting Manager",
        "BI Platform Administrator",
        "Data Governance Lead",
        "Analytics Solution Designer",
        "Chief Data Officer"
      ]
    },
    
  "SAP Fieldglass": {
    "courseImage": "/CourseDetails/sap-fieldglass-course.jpg",
    "courseDescription": "Specialized training in SAP Fieldglass covering contingent workforce, services procurement, and SOW management for HR and procurement professionals.",
    "section1": {
      "title": "SAP Fieldglass Course Content",
      "description": "Our curriculum covers all Fieldglass modules from requisition to analytics, using real-world workforce scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP Fieldglass Skills Matter",
      "description": "Contingent workforce management requires specialized platform knowledge.",
      "bulletPoints": [
        "Market Leader: #1 VMS platform",
        "High Demand: 65% growth in contingent workforce roles (2023)",
        "Comprehensive: End-to-end services procurement",
        "Certification Path: Prepares for SAP Fieldglass certification",
        "Future-Proof: Integrated with SAP SuccessFactors"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP Fieldglass Consultant",
        "Contingent Workforce Manager",
        "Services Procurement Specialist",
        "VMS Administrator",
        "Workforce Analytics Lead",
        "Talent Acquisition Technologist",
        "HRIS Analyst (Contingent)",
        "Vendor Management Lead"
      ]
    }
  },
  
  "SAP Data Archiving": {
    "courseImage": "/CourseDetails/sap-data-archiving-course.jpg",
    "courseDescription": "Professional training in SAP Data Archiving covering compliance, retention policies, and system optimization for SAP basis and data managers.",
    "section1": {
      "title": "SAP Data Archiving Course Content",
      "description": "Our curriculum covers all archiving modules from object configuration to access methods, using real-world compliance scenarios and hands-on exercises."
    },
    "section2": {
      "title": "Why Data Archiving Skills Matter",
      "description": "System performance and compliance require specialized archiving knowledge.",
      "bulletPoints": [
        "Critical Function: Impacts all SAP modules",
        "High Demand: 45% growth in data governance roles (2023)",
        "Compliance-Ready: Meets legal retention requirements",
        "Performance Impact: Essential for system optimization",
        "Future-Proof: Enhanced in S/4HANA"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP Data Archiving Consultant",
        "SAP Basis Archiving Specialist",
        "Data Governance Analyst",
        "Compliance Data Manager",
        "SAP System Performance Analyst",
        "Information Lifecycle Manager",
        "Records Management Specialist",
        "Enterprise Archiving Lead"
      ]
    }
  },
  
  "SAP Solution Manager": {
    "courseImage": "/CourseDetails/sap-solution-manager-course.jpg",
    "courseDescription": "Comprehensive training in SAP Solution Manager covering system monitoring, change control, and implementation methodologies for SAP administrators.",
    "section1": {
      "title": "SAP SolMan Course Content",
      "description": "Our curriculum covers all Solution Manager capabilities from monitoring to testing, using real-world SAP landscape scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why Solution Manager Skills Matter",
      "description": "SAP operations and implementation require centralized management.",
      "bulletPoints": [
        "Central Hub: Manages entire SAP landscape",
        "High Demand: 60% growth in SAP ops roles (2023)",
        "Implementation Standard: Used for all SAP projects",
        "Certification Path: Prepares for SAP SolMan certification",
        "Future-Proof: Enhanced for S/4HANA"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP Solution Manager Consultant",
        "SAP Basis Administrator",
        "SAP Change Manager",
        "SAP Application Manager",
        "SAP Release Coordinator",
        "SAP Landscape Architect",
        "SAP Operations Lead",
        "SAP Center of Excellence Manager"
      ]
    }
  },
  
  "SAP Aerospace & Defense": {
    "courseImage": "/CourseDetails/sap-aerospace-and-defense-course.jpg",
    "courseDescription": "Specialized training in SAP solutions for Aerospace & Defense covering manufacturing, MRO, and compliance for A&D industry professionals.",
    "section1": {
      "title": "SAP A&D Course Content",
      "description": "Our curriculum covers all A&D-specific modules from engineering to project systems, using real-world aerospace scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why SAP A&D Skills Matter",
      "description": "Aerospace digital transformation requires industry-specific SAP knowledge.",
      "bulletPoints": [
        "Industry-Specific: Tailored for A&D requirements",
        "High Demand: 70% growth in A&D tech roles (2023)",
        "Compliance-Ready: ITAR/EAR focused training",
        "Certification Path: Prepares for SAP A&D certification",
        "Future-Proof: S/4HANA for A&D compatible"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "SAP A&D Consultant",
        "Aerospace Manufacturing Analyst",
        "MRO Systems Specialist",
        "Defense Program Manager",
        "A&D Compliance Analyst",
        "Aircraft Production Planner",
        "A&D Solution Architect",
        "Aerospace IT Project Lead"
      ]
    }
  },
  
  "Oracle CPQ Training": {
    "courseImage": "/CourseDetails/oracle-cpq-course.jpg",
    "courseDescription": "Specialized Oracle CPQ training for sales and configuration professionals covering product configuration, quoting processes, and document generation. Learn from certified Oracle CPQ consultants with real-world experience.",
    "section1": {
      "title": "Oracle CPQ Course Content",
      "description": "Our curriculum covers all CPQ modules from product configuration to document generation, using real-world scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why Oracle CPQ Skills Matter",
      "description": "Digital sales transformation requires specialized CPQ knowledge.",
      "bulletPoints": [
        "Sales Enablement: Streamline quoting processes",
        "High Demand: 35% growth in CPQ roles (2023)",
        "Revenue Optimization: Price configuration expertise",
        "Certification Path: Prepares for Oracle CPQ certification",
        "Cloud-Ready: Full SaaS solution training"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "Oracle CPQ Consultant",
        "Sales Configuration Analyst",
        "Pricing Specialist",
        "Quote-to-Cash Manager",
        "CPQ System Administrator",
        "Sales Operations Analyst",
        "Business Systems Consultant",
        "CPQ Implementation Specialist"
      ]
    }
  },
  
  "Oracle Procure to Pay Training": {
    "courseImage": "/CourseDetails/oracle-procure-to-pay-course.jpg",
    "courseDescription": "Specialized Oracle training for procurement and accounts payable professionals covering the complete procure-to-pay lifecycle from requisitioning to payment processing.",
    "section1": {
      "title": "Oracle Procure to Pay Course Content",
      "description": "Our curriculum covers all procurement and payables modules from supplier management to payment processing, using real-world scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why Procure to Pay Skills Matter",
      "description": "Streamlined procurement processes require specialized Oracle knowledge.",
      "bulletPoints": [
        "Process Efficiency: End-to-end P2P training",
        "High Demand: 30% growth in procurement system roles (2023)",
        "Cost Control: Advanced purchasing techniques",
        "Certification Path: Prepares for Oracle Financials certification",
        "Integration Ready: ERP ecosystem training"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "Oracle Procurement Consultant",
        "Accounts Payable Specialist",
        "Purchasing System Analyst",
        "Procurement Manager",
        "Supply Chain Systems Analyst",
        "Financial Systems Administrator",
        "P2P Process Consultant",
        "Oracle Implementation Specialist"
      ]
    }
  },
  
  "Oracle Hyperion EPM Training": {
    "courseImage": "/CourseDetails/oracle-hyperion-epm-course.jpg",
    "courseDescription": "Specialized Oracle EPM training for finance professionals covering financial consolidation, planning, budgeting, and reporting using Hyperion solutions.",
    "section1": {
      "title": "Oracle Hyperion EPM Course Content",
      "description": "Our curriculum covers all EPM modules from financial close to planning and reporting, using real-world scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why Hyperion EPM Skills Matter",
      "description": "Modern FP&A requires specialized EPM knowledge.",
      "bulletPoints": [
        "Financial Transformation: Enterprise performance management",
        "High Demand: 45% growth in EPM roles (2023)",
        "Strategic Planning: Advanced budgeting techniques",
        "Certification Path: Prepares for Oracle EPM certification",
        "Cloud Migration: EPM Cloud training included"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "Oracle EPM Consultant",
        "Financial Systems Analyst",
        "Corporate Performance Manager",
        "FP&A Systems Specialist",
        "Essbase Developer",
        "Financial Consolidation Specialist",
        "EPM Cloud Administrator",
        "Business Intelligence Analyst"
      ]
    }
  },
  
  "Oracle GRC Controls Suite Fundamentals": {
    "courseImage": "/CourseDetails/oracle-grc-controls-course.jpg",
    "courseDescription": "Specialized Oracle GRC training for risk and compliance professionals covering continuous controls monitoring, access governance, and risk management frameworks.",
    "section1": {
      "title": "Oracle GRC Course Content",
      "description": "Our curriculum covers all GRC modules from architecture to remediation, using real-world compliance scenarios and hands-on configuration."
    },
    "section2": {
      "title": "Why GRC Controls Skills Matter",
      "description": "Modern risk management requires specialized GRC knowledge.",
      "bulletPoints": [
        "Risk Mitigation: Proactive controls monitoring",
        "High Demand: 50% growth in GRC roles (2023)",
        "Compliance Ready: SOX and regulatory training",
        "Certification Path: Prepares for Oracle GRC certification",
        "Enterprise-Wide: Cross-platform implementation"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "GRC Controls Consultant",
        "Risk Management Analyst",
        "Compliance Officer",
        "Access Governance Specialist",
        "IT Security Auditor",
        "Internal Controls Manager",
        "SOX Compliance Analyst",
        "Enterprise Risk Consultant"
      ]
    }
  },
  
  "Oracle Developer Course": {
    "courseImage": "/CourseDetails/oracle-developer-course.jpg",
    "courseDescription": "Comprehensive Oracle Developer training covering database programming with SQL/PLSQL and application development with Forms and Reports.",
    "section1": {
      "title": "Oracle Developer Course Content",
      "description": "Our curriculum covers all developer tools from SQL fundamentals to Forms and Reports development, using real-world business scenarios."
    },
    "section2": {
      "title": "Why Oracle Developer Skills Matter",
      "description": "Enterprise application development requires specialized Oracle knowledge.",
      "bulletPoints": [
        "Full-Stack Development: Database to UI",
        "High Demand: 35% growth in Oracle developer roles",
        "Legacy Modernization: Maintain critical systems",
        "Certification Path: Prepares for Oracle Developer certification",
        "Career Flexibility: Database and application skills"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "Oracle Forms Developer",
        "PL/SQL Developer",
        "Database Application Developer",
        "Reports Specialist",
        "ERP Technical Consultant",
        "Legacy Systems Analyst",
        "Database Programmer",
        "Business Intelligence Developer"
      ]
    }
  },
  
  "Oracle SQL & PL/SQL": {
    "courseImage": "/CourseDetails/oracle-sql-plsql-course.jpg",
    "courseDescription": "Specialized Oracle database programming training covering both SQL querying and PL/SQL development for robust database applications.",
    "section1": {
      "title": "Oracle SQL & PL/SQL Course Content",
      "description": "Our curriculum covers all aspects of database programming from basic SQL to advanced PL/SQL techniques, using real-world data scenarios."
    },
    "section2": {
      "title": "Why SQL & PL/SQL Skills Matter",
      "description": "Database programming is fundamental to enterprise systems.",
      "bulletPoints": [
        "Database Foundation: Core Oracle skills",
        "High Demand: 40% growth in database roles",
        "Performance Optimization: Write efficient queries",
        "Certification Path: Prepares for Oracle SQL and PL/SQL certifications",
        "Career Versatility: Applicable across industries"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "Oracle Database Developer",
        "PL/SQL Developer",
        "Database Administrator",
        "ETL Developer",
        "Business Intelligence Analyst",
        "Data Analyst",
        "Application Developer",
        "Database Architect"
      ]
    }
  },
  
  "Oracle Forms and Reports": {
    "courseImage": "/CourseDetails/oracle-forms-reports-course.jpg",
    "courseDescription": "Specialized Oracle training covering application development with Forms and business reporting with Reports for enterprise solutions.",
    "section1": {
      "title": "Oracle Forms and Reports Course Content",
      "description": "Our curriculum covers all aspects of Forms application development and Reports design, using real-world business scenarios."
    },
    "section2": {
      "title": "Why Forms and Reports Skills Matter",
      "description": "Enterprise applications require specialized Oracle development skills.",
      "bulletPoints": [
        "Rapid Application Development: Build data-entry systems quickly",
        "High Demand: 30% growth in legacy system roles",
        "Business Reporting: Create complex reports",
        "Certification Path: Prepares for Oracle Forms/Reports certification",
        "Career Longevity: Maintain critical business systems"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "Oracle Forms Developer",
        "Reports Developer",
        "ERP Technical Consultant",
        "Legacy Systems Analyst",
        "Business Intelligence Developer",
        "Database Application Developer",
        "Systems Integration Specialist",
        "Technical Support Engineer"
      ]
    }
  },
  
  "Oracle Application Framework (OAF)": {
    "courseImage": "/CourseDetails/oracle-oaf-course.jpg",
    "courseDescription": "Specialized OAF training for E-Business Suite developers covering custom application development using Oracle's MVC framework.",
    "section1": {
      "title": "OAF Course Content",
      "description": "Our curriculum covers all OAF components from model-view-controller architecture to deployment, using real E-Business Suite scenarios."
    },
    "section2": {
      "title": "Why OAF Skills Matter",
      "description": "EBS customization requires specialized framework knowledge.",
      "bulletPoints": [
        "EBS Customization: Extend Oracle applications",
        "High Demand: 35% growth in EBS technical roles",
        "Modern Architecture: MVC pattern implementation",
        "Certification Path: Prepares for Oracle OAF certification",
        "Career Longevity: Maintain critical business systems"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "OAF Developer",
        "EBS Technical Consultant",
        "Oracle Applications Developer",
        "ERP Systems Analyst",
        "Technical Architect",
        "Legacy Systems Developer",
        "Business Systems Analyst",
        "Integration Specialist"
      ]
    }
  },
  
  "Oracle Cloud Infrastructure (OCI)": {
    "courseImage": "/CourseDetails/oracle-cloud-infra-course.jpg",
    "courseDescription": "Comprehensive OCI training covering infrastructure services, database solutions, and cloud-native development for enterprise workloads.",
    "section1": {
      "title": "OCI Course Content",
      "description": "Our curriculum covers all OCI services from foundational to advanced topics, using real-world cloud deployment scenarios."
    },
    "section2": {
      "title": "Why OCI Skills Matter",
      "description": "Cloud transformation requires specialized infrastructure knowledge.",
      "bulletPoints": [
        "Enterprise Cloud: Oracle's Gen2 architecture",
        "High Demand: 60% growth in cloud roles (2023)",
        "Database Leadership: Autonomous DB expertise",
        "Certification Path: Prepares for OCI certifications",
        "Hybrid Ready: On-premises integration"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "OCI Architect",
        "Cloud Engineer",
        "DevOps Specialist",
        "Cloud DBA",
        "Solutions Architect",
        "Infrastructure Engineer",
        "Cloud Security Specialist",
        "Migration Consultant"
      ]
    }
  },
  
  "WebLogic Server": {
    "courseImage": "/CourseDetails/oracle-weblogic-course.jpg",
    "courseDescription": "Specialized WebLogic training for middleware administrators covering installation, configuration, and management of enterprise Java applications.",
    "section1": {
      "title": "WebLogic Course Content",
      "description": "Our curriculum covers all aspects of WebLogic administration from basic configuration to advanced clustering, using real-world deployment scenarios."
    },
    "section2": {
      "title": "Why WebLogic Skills Matter",
      "description": "Enterprise Java requires specialized middleware knowledge.",
      "bulletPoints": [
        "Market Leader: #1 application server",
        "High Demand: 40% growth in middleware roles",
        "Performance Optimization: Tuning expertise",
        "Certification Path: Prepares for WebLogic certification",
        "Cloud Ready: OCI integration"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "WebLogic Administrator",
        "Middleware Engineer",
        "Java EE Architect",
        "DevOps Engineer",
        "Application Server Specialist",
        "Performance Tuning Consultant",
        "Cloud Migration Specialist",
        "Enterprise Integration Engineer"
      ]
    }
  },
  
  "Oracle PeopleSoft HRMS/HCM": {
    "courseImage": "/CourseDetails/oracle-peoplesoft-course.jpg",
    "courseDescription": "Specialized PeopleSoft training for HR professionals covering core HR, payroll, and benefits functionality with technical implementation skills.",
    "section1": {
      "title": "PeopleSoft Course Content",
      "description": "Our curriculum covers all HRMS modules from foundational concepts to advanced reporting, using real-world HR scenarios."
    },
    "section2": {
      "title": "Why PeopleSoft Skills Matter",
      "description": "Enterprise HR systems require specialized PeopleSoft knowledge.",
      "bulletPoints": [
        "HRIS Leadership: Market-leading solution",
        "High Demand: 30% growth in PeopleSoft roles",
        "Global HR: Multi-country implementation",
        "Certification Path: Prepares for PeopleSoft certification",
        "Career Longevity: Maintain critical HR systems"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "PeopleSoft Consultant",
        "HRIS Analyst",
        "Payroll Specialist",
        "Benefits Administrator",
        "Technical Developer",
        "Reporting Analyst",
        "Systems Administrator",
        "Implementation Specialist"
      ]
    }
  },
  
  "Oracle Customer Care & Billing (CC&B)": {
    "courseImage": "/CourseDetails/oracle-ccb-course.jpg",
    "courseDescription": "Specialized CC&B training for utility professionals covering customer lifecycle management, meter-to-cash processes, and field service operations.",
    "section1": {
      "title": "CC&B Course Content",
      "description": "Our curriculum covers all CC&B modules from customer management to advanced billing configuration, using real-world utility scenarios."
    },
    "section2": {
      "title": "Why CC&B Skills Matter",
      "description": "Utility digital transformation requires specialized billing knowledge.",
      "bulletPoints": [
        "Industry-Specific: Utility billing expertise",
        "High Demand: 45% growth in CC&B roles (2023)",
        "Regulatory Compliance: Rate case support",
        "Certification Path: Prepares for Oracle CC&B certification",
        "Customer Experience: Omnichannel integration"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "CC&B Consultant",
        "Billing System Analyst",
        "Customer Care Specialist",
        "Field Service Manager",
        "Revenue Assurance Analyst",
        "Utility Systems Architect",
        "Implementation Specialist",
        "Business Process Analyst"
      ]
    }
  },
  
  "R12.x Oracle Inventory Management": {
    "courseImage": "/CourseDetails/oracle-inventory-course.jpg",
    "courseDescription": "Specialized Inventory training covering warehouse management, item control, and supply chain optimization in Oracle E-Business Suite.",
    "section1": {
      "title": "Inventory Course Content",
      "description": "Our curriculum covers all inventory modules from basic setup to advanced optimization techniques, using real supply chain scenarios."
    },
    "section2": {
      "title": "Why Inventory Skills Matter",
      "description": "Supply chain efficiency requires specialized inventory knowledge.",
      "bulletPoints": [
        "Operational Excellence: Inventory optimization",
        "High Demand: 35% growth in supply chain tech roles",
        "Cost Control: Reduce carrying costs",
        "Certification Path: Prepares for Oracle Inventory certification",
        "ERP Integration: Full EBS ecosystem"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "Inventory Analyst",
        "Supply Chain Consultant",
        "Warehouse Systems Manager",
        "ERP Inventory Specialist",
        "Materials Manager",
        "Operations Planner",
        "Logistics Systems Analyst",
        "Implementation Consultant"
      ]
    }
  },
  
  "R12.2 Oracle E-Business Tax": {
    "courseImage": "/CourseDetails/oracle-ebtax-course.jpg",
    "courseDescription": "Specialized E-Business Tax training covering global tax configuration, compliance, and reporting for Oracle E-Business Suite implementations.",
    "section1": {
      "title": "E-Business Tax Course Content",
      "description": "Our curriculum covers all tax modules from basic configuration to advanced reporting, using real-world compliance scenarios."
    },
    "section2": {
      "title": "Why E-Business Tax Skills Matter",
      "description": "Global operations require specialized tax knowledge.",
      "bulletPoints": [
        "Compliance Focus: Regulatory requirements",
        "High Demand: 50% growth in tax system roles",
        "Global Coverage: 190+ countries",
        "Certification Path: Prepares for Oracle Tax certification",
        "Risk Mitigation: Audit protection"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "Tax Systems Consultant",
        "Global Tax Analyst",
        "VAT Compliance Specialist",
        "ERP Tax Configurator",
        "Financial Systems Analyst",
        "Implementation Specialist",
        "Tax Technology Manager",
        "Reporting Analyst"
      ]
    }
  },
  
  "R12.x Oracle Order Management": {
    "courseImage": "/CourseDetails/oracle-order-mgmt-course.jpg",
    "courseDescription": "Specialized Order Management training covering the complete order-to-cash cycle in Oracle E-Business Suite implementations.",
    "section1": {
      "title": "Order Management Course Content",
      "description": "Our curriculum covers all OM modules from basic setup to advanced fulfillment scenarios, using real-world order processing examples."
    },
    "section2": {
      "title": "Why Order Management Skills Matter",
      "description": "Customer experience requires specialized order knowledge.",
      "bulletPoints": [
        "Revenue Cycle: Order-to-cash expertise",
        "High Demand: 40% growth in OM roles",
        "Integration Points: Full EBS ecosystem",
        "Certification Path: Prepares for Oracle OM certification",
        "Customer Satisfaction: Streamlined fulfillment"
      ]
    },
    "section3": {
      "title": "Career Opportunities After Training",
      "description": "Graduates can pursue roles such as:",
      "bulletPoints": [
        "OM Consultant",
        "Order Fulfillment Specialist",
        "Pricing Analyst",
        "Shipping Coordinator",
        "ERP Systems Analyst",
        "Business Process Consultant",
        "Implementation Specialist",
        "Customer Experience Analyst"
      ]
    }
  },

  

  "IBM DataPower": {
    "courseImage": "/CourseDetails/ibm-datapower.jpg",
    "courseDescription": "Our IBM DataPower course provides comprehensive training in IBM WebSphere DataPower SOA Appliances for secure service integration. You'll learn to configure various services, implement security protocols, and troubleshoot DataPower environments.",
    "section1": {
      "title": "IBM DataPower Course Content",
      "description": "The course covers DataPower services configuration, XML firewall implementation, multi-protocol gateway setup, web service security, SSL connectivity, and troubleshooting techniques for enterprise service integration."
    },
    "section2": {
      "title": "The Power of DataPower",
      "description": "IBM DataPower is a critical component for enterprise service integration and security.",
      "bulletPoints": [
        "Service Integration: Connect diverse protocols and formats",
        "Security: Implement robust XML threat protection",
        "Performance: Accelerate XML processing",
        "Simplification: Reduce integration complexity",
        "Governance: Enforce consistent policies across services"
      ]
    },
    "section3": {
      "title": "DataPower Career Applications",
      "description": "DataPower skills enhance these technical roles:",
      "bulletPoints": [
        "Integration Architect",
        "SOA Specialist",
        "Middleware Administrator",
        "Security Engineer",
        "Cloud Integration Specialist",
        "API Developer",
        "Enterprise Architect",
        "Technical Consultant"
      ]
    }
  },
  "IBM Cognos": {
    "courseImage": "/CourseDetails/ibm-cognos.jpg",
    "courseDescription": "Our IBM Cognos course delivers hands-on training in business intelligence, data warehousing, and reporting. You'll master Framework Manager modeling, Report Studio development, and dashboard creation for enterprise analytics.",
    "section1": {
      "title": "IBM Cognos Course Content",
      "description": "The course covers data warehouse concepts, Framework Manager modeling, Report Studio development, dashboard creation, OLAP analysis, and event management in IBM Cognos BI environment."
    },
    "section2": {
      "title": "The Power of Cognos BI",
      "description": "IBM Cognos is a leading business intelligence platform for enterprise reporting and analytics.",
      "bulletPoints": [
        "Enterprise Reporting: Create sophisticated reports",
        "Self-Service BI: Empower business users",
        "Data Visualization: Build interactive dashboards",
        "Performance Management: Monitor KPIs",
        "Scalability: Handle enterprise data volumes"
      ]
    },
    "section3": {
      "title": "Cognos Career Applications",
      "description": "Cognos skills enhance these technical roles:",
      "bulletPoints": [
        "BI Developer",
        "Data Analyst",
        "Reporting Specialist",
        "Business Intelligence Architect",
        "Data Warehouse Developer",
        "Analytics Consultant",
        "Performance Management Specialist",
        "ETL Developer"
      ]
    }
  },
  "IBM Watson Analytics": {
    "courseImage": "/CourseDetails/ibm-watson.jpg",
    "courseDescription": "Our IBM Watson Analytics course provides practical training in cognitive-powered data exploration and predictive analytics. You'll learn to use natural language processing to uncover insights and create compelling visualizations.",
    "section1": {
      "title": "IBM Watson Analytics Course Content",
      "description": "The course covers Watson Analytics interface, data refinement techniques, predictive analytics, natural language processing, data visualization, and sharing capabilities for collaborative analytics."
    },
    "section2": {
      "title": "The Power of Watson Analytics",
      "description": "Watson Analytics brings cognitive computing to business analytics.",
      "bulletPoints": [
        "Cognitive Computing: Natural language interaction",
        "Predictive Analytics: Discover hidden patterns",
        "Data Exploration: Intuitive visual discovery",
        "Collaboration: Share insights across teams",
        "Cloud-Based: Access from anywhere"
      ]
    },
    "section3": {
      "title": "Watson Analytics Career Applications",
      "description": "Watson Analytics skills enhance these roles:",
      "bulletPoints": [
        "Data Scientist",
        "Business Analyst",
        "Marketing Analyst",
        "Financial Analyst",
        "Healthcare Analyst",
        "Research Analyst",
        "Customer Insights Specialist",
        "Cognitive Solutions Developer"
      ]
    }
  },
  "IBM SPSS": {
    "courseImage": "/CourseDetails/ibm-spss.jpg",
    "courseDescription": "Our IBM SPSS course provides comprehensive training in statistical analysis, from basic data management to advanced predictive modeling. You'll learn to transform raw data into meaningful insights using IBM's premier statistical software.",
    "section1": {
      "title": "SPSS Course Content",
      "description": "The course covers data preparation, descriptive statistics, hypothesis testing, regression analysis, factor/cluster analysis, and advanced techniques like logistic regression and survival analysis."
    },
    "section2": {
      "title": "The Power of SPSS",
      "description": "SPSS is the industry standard for statistical analysis in research and business.",
      "bulletPoints": [
        "Statistical Analysis: Comprehensive tools for researchers",
        "Data Visualization: Create publication-ready charts",
        "Predictive Analytics: Advanced modeling capabilities",
        "Ease of Use: Both GUI and syntax options",
        "Industry Standard: Widely used in academia and business"
      ]
    },
    "section3": {
      "title": "SPSS Career Applications",
      "description": "SPSS skills enhance these professional roles:",
      "bulletPoints": [
        "Data Analyst",
        "Market Researcher",
        "Healthcare Analyst",
        "Social Scientist",
        "Business Intelligence Specialist",
        "Academic Researcher",
        "Quality Assurance Analyst",
        "Government Statistician"
      ]
    }
  },
  "IBM Cloud Essentials": {
    "courseImage": "/CourseDetails/ibm-cloud.jpg",
    "courseDescription": "Our IBM Cloud Essentials course provides foundational knowledge of IBM Cloud infrastructure, services, and deployment models. You'll gain hands-on experience with virtual servers, containers, and cloud-native services.",
    "section1": {
      "title": "IBM Cloud Course Content",
      "description": "The course covers cloud fundamentals, infrastructure components, application deployment options, and IBM Cloud services including AI, blockchain, and IoT."
    },
    "section2": {
      "title": "The Power of IBM Cloud",
      "description": "IBM Cloud offers enterprise-grade cloud solutions with unique capabilities.",
      "bulletPoints": [
        "Hybrid Cloud: Seamless integration with on-prem systems",
        "AI Integration: Built-in Watson services",
        "Enterprise Focus: Designed for business-critical workloads",
        "Security: Industry-leading compliance certifications",
        "Global Reach: Data centers worldwide"
      ]
    },
    "section3": {
      "title": "IBM Cloud Career Applications",
      "description": "IBM Cloud skills enhance these technical roles:",
      "bulletPoints": [
        "Cloud Architect",
        "DevOps Engineer",
        "Cloud Administrator",
        "Solutions Architect",
        "Full Stack Developer",
        "Cloud Security Specialist",
        "SRE (Site Reliability Engineer)",
        "Technical Consultant"
      ]
    }
  },
  "IBM Bluemix": {
    "courseImage": "/CourseDetails/ibm-bluemix.jpg",
    "courseDescription": "Our IBM Bluemix course teaches application development and deployment on IBM's cloud platform. You'll learn to leverage Cloud Foundry, Docker, and managed services to build scalable cloud applications.",
    "section1": {
      "title": "Bluemix Course Content",
      "description": "The course covers cloud application development, Cloud Foundry CLI, REST API integration, DevOps tools, and data services in the Bluemix environment."
    },
    "section2": {
      "title": "The Power of Bluemix",
      "description": "Bluemix (now part of IBM Cloud) provides robust PaaS capabilities.",
      "bulletPoints": [
        "Rapid Deployment: Cloud Foundry for quick app hosting",
        "Container Support: Docker and Kubernetes integration",
        "Service Ecosystem: 170+ services available",
        "DevOps Integration: Built-in CI/CD pipelines",
        "Scalability: Automatic scaling capabilities"
      ]
    },
    "section3": {
      "title": "Bluemix Career Applications",
      "description": "Bluemix skills enhance these roles:",
      "bulletPoints": [
        "Cloud Application Developer",
        "Platform Engineer",
        "API Developer",
        "Cloud Consultant",
        "Microservices Architect",
        "DevOps Specialist",
        "Technical Lead",
        "Integration Specialist"
      ]
    }
  },
  "IBM QRadar SIEM": {
    "courseImage": "/CourseDetails/ibm-qradar.jpg",
    "courseDescription": "Our IBM QRadar SIEM course provides expert training in security information and event management. You'll learn threat detection, log analysis, and incident response using IBM's enterprise SIEM solution.",
    "section1": {
      "title": "QRadar Course Content",
      "description": "The course covers QRadar architecture, log collection, event correlation, offense management, vulnerability assessment, and security operations workflows."
    },
    "section2": {
      "title": "The Power of QRadar",
      "description": "QRadar is a leader in the SIEM market for enterprise security.",
      "bulletPoints": [
        "Threat Detection: Advanced correlation rules",
        "Compliance: Meets regulatory requirements",
        "Visibility: Unified security view",
        "Scalability: Handles enterprise-scale data",
        "Integration: Works with 400+ log sources"
      ]
    },
    "section3": {
      "title": "QRadar Career Applications",
      "description": "QRadar skills enhance these security roles:",
      "bulletPoints": [
        "Security Analyst",
        "SOC Engineer",
        "SIEM Administrator",
        "Threat Hunter",
        "Cybersecurity Consultant",
        "Incident Responder",
        "Security Architect",
        "Compliance Analyst"
      ]
    }
  },
  
  "IBM BPM Administration": {
    "courseImage": "/CourseDetails/ibm-bpm.jpg",
    "courseDescription": "Our IBM BPM Administration course provides comprehensive training in installing, configuring, and optimizing IBM Business Process Management solutions for enterprise process automation.",
    "section1": {
      "title": "IBM BPM Course Content",
      "description": "The course covers BPM architecture, installation, environment management, process deployment, performance tuning, integration techniques, and advanced administration."
    },
    "section2": {
      "title": "The Power of IBM BPM",
      "description": "IBM BPM is a complete platform for business process management and automation.",
      "bulletPoints": [
        "Process Automation: Streamline business workflows",
        "Visibility: Real-time process monitoring",
        "Agility: Rapid process modification",
        "Integration: Connect with diverse enterprise systems",
        "Collaboration: Business-IT alignment"
      ]
    },
    "section3": {
      "title": "BPM Career Applications",
      "description": "BPM skills enhance these professional roles:",
      "bulletPoints": [
        "BPM Administrator",
        "Process Architect",
        "Integration Specialist",
        "Enterprise Architect",
        "Middleware Administrator",
        "Solutions Consultant",
        "Business Analyst",
        "Technical Lead"
      ]
    }
  },
  "IBM Sterling": {
    "courseImage": "/CourseDetails/ibm-sterling.jpg",
    "courseDescription": "Our IBM Sterling course provides specialized training in Sterling technologies and JCL programming for mainframe environments and enterprise integration scenarios.",
    "section1": {
      "title": "Sterling Course Content",
      "description": "The course covers JCL programming, job control statements, dataset management, cataloged procedures, GDG management, and job processing control."
    },
    "section2": {
      "title": "The Power of IBM Sterling",
      "description": "IBM Sterling technologies enable robust enterprise integration and mainframe operations.",
      "bulletPoints": [
        "Mainframe Expertise: Critical for legacy systems",
        "Job Control: Precise execution management",
        "Data Handling: Efficient dataset management",
        "Enterprise Integration: Connect diverse systems",
        "Reliability: Proven in mission-critical environments"
      ]
    },
    "section3": {
      "title": "Sterling Career Applications",
      "description": "Sterling skills enhance these technical roles:",
      "bulletPoints": [
        "Mainframe Administrator",
        "JCL Programmer",
        "Systems Programmer",
        "Batch Operations Specialist",
        "Enterprise Integration Developer",
        "Technical Consultant",
        "Legacy Systems Analyst",
        "Data Center Technician"
      ]
    }
  },
  "WebSphere Application Server": {
    "courseImage": "/CourseDetails/websphere.jpg",
    "courseDescription": "Our WebSphere Application Server course delivers expert training in WAS administration, from installation and configuration to advanced clustering and troubleshooting.",
    "section1": {
      "title": "WAS Course Content",
      "description": "The course covers WAS architecture, installation, application deployment, messaging, security, clustering, administrative scripting, and performance troubleshooting."
    },
    "section2": {
      "title": "The Power of WebSphere",
      "description": "WebSphere Application Server is IBM's flagship application deployment platform.",
      "bulletPoints": [
        "Enterprise-Grade: For mission-critical applications",
        "Scalability: Handle high-volume workloads",
        "Security: Robust protection mechanisms",
        "Integration: Connect with diverse middleware",
        "Reliability: Proven in global enterprises"
      ]
    },
    "section3": {
      "title": "WAS Career Applications",
      "description": "WAS skills enhance these roles:",
      "bulletPoints": [
        "Middleware Administrator",
        "Application Server Specialist",
        "DevOps Engineer",
        "Enterprise Architect",
        "Technical Consultant",
        "Systems Integrator",
        "Performance Analyst",
        "Infrastructure Engineer"
      ]
    }
  },
  "IBM AIX": {
    "courseImage": "/CourseDetails/ibm-aix.jpg",
    "courseDescription": "Our IBM AIX course provides comprehensive training in AIX operating system administration, from basic operations to advanced system management and troubleshooting.",
    "section1": {
      "title": "AIX Course Content",
      "description": "The course covers AIX installation, LVM management, security administration, storage technologies, performance tuning, networking, and troubleshooting methodologies."
    },
    "section2": {
      "title": "The Power of AIX",
      "description": "IBM AIX is a robust UNIX operating system for enterprise environments.",
      "bulletPoints": [
        "Reliability: Proven in mission-critical systems",
        "Scalability: Handles enterprise workloads",
        "Security: Advanced protection features",
        "Virtualization: PowerVM and WPAR capabilities",
        "Performance: Optimized for POWER architecture"
      ]
    },
    "section3": {
      "title": "AIX Career Applications",
      "description": "AIX skills enhance these professional roles:",
      "bulletPoints": [
        "UNIX System Administrator",
        "AIX Specialist",
        "Infrastructure Engineer",
        "Technical Support Engineer",
        "Cloud Administrator",
        "DevOps Engineer",
        "Storage Administrator",
        "Data Center Technician"
      ]
    }
  },
  
  "IBM Mainframe Developer": {
    "courseImage": "/CourseDetails/ibm-mainframe.jpg",
    "courseDescription": "Our IBM Mainframe Developer course provides comprehensive training in JCL programming and mainframe job control for enterprise batch processing and system integration.",
    "section1": {
      "title": "Mainframe Developer Course Content",
      "description": "The course covers JCL programming fundamentals, job control statements, dataset management, cataloged procedures, GDG management, and advanced job processing techniques."
    },
    "section2": {
      "title": "The Power of Mainframe Development",
      "description": "IBM mainframes remain the backbone of enterprise computing for mission-critical applications.",
      "bulletPoints": [
        "Enterprise Reliability: Proven in mission-critical systems",
        "Batch Processing: High-volume transaction handling",
        "Data Integrity: Robust dataset management",
        "Job Control: Precise execution management",
        "Legacy Integration: Connect with core business systems"
      ]
    },
    "section3": {
      "title": "Mainframe Career Applications",
      "description": "Mainframe skills enhance these professional roles:",
      "bulletPoints": [
        "Mainframe Developer",
        "JCL Programmer",
        "Batch Operations Specialist",
        "Systems Programmer",
        "Technical Support Engineer",
        "Legacy Systems Analyst",
        "Data Center Technician",
        "Enterprise Integration Specialist"
      ]
    }
  },
  "IBM Tivoli": {
    "courseImage": "/CourseDetails/ibm-tivoli.jpg",
    "courseDescription": "Our IBM Tivoli course delivers expert training in system monitoring, configuration management, and automation using IBM's comprehensive Tivoli suite.",
    "section1": {
      "title": "Tivoli Course Content",
      "description": "The course covers Tivoli installation, monitoring, event management, configuration control, security administration, backup/recovery, and integration techniques."
    },
    "section2": {
      "title": "The Power of IBM Tivoli",
      "description": "IBM Tivoli provides comprehensive solutions for enterprise system management.",
      "bulletPoints": [
        "Centralized Monitoring: Single-pane-of-glass visibility",
        "Automation: Reduce manual intervention",
        "Compliance: Meet regulatory requirements",
        "Incident Management: Proactive problem resolution",
        "Hybrid Environment Support: Manage diverse infrastructures"
      ]
    },
    "section3": {
      "title": "Tivoli Career Applications",
      "description": "Tivoli skills enhance these technical roles:",
      "bulletPoints": [
        "System Administrator",
        "IT Operations Manager",
        "Cloud Administrator",
        "DevOps Engineer",
        "Site Reliability Engineer",
        "Technical Consultant",
        "Infrastructure Architect",
        "IT Security Specialist"
      ]
    }
  }























  
}











}
